{"id":"368La1qZAv72idE55Whuffkk2TBtHuSndX6iNywdUkLBDxxx55cLvowsw5Rj5VbHUHjCYUBR5tHfX6BAYFQZS3af","title":"top scoring links : europe","displayTitle":"News - Reddit - Europe","url":"https://www.reddit.com/r/europe/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/europe/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"Pope died of a stroke and heart failure, Vatican doctor says","url":"https://www.reuters.com/world/europe/pope-died-stroke-heart-failure-vatican-doctor-says-2025-04-21/","date":1745261983,"author":"/u/plutobug2468","guid":503,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k4ljeb/pope_died_of_a_stroke_and_heart_failure_vatican/"},{"title":"Ekrem Imamoglu: Erdogan's end has appeared. Turkey's new government will work with the EU and allies, considering mutual interests, rule of law, and democracy based on human rights. I don't have the slightest doubt that Turkey will join the EU under our rule","url":"https://www.ekonomim.com/gundem/imamoglundan-almanyaya-cagri-bu-kararinizi-geri-almanizi-istirham-ediyorum-haberi-813497","date":1745261643,"author":"/u/turkish__cowboy","guid":502,"unread":true,"content":"<p>Ekrem İmamoğlu&nbsp;sosyal medya hesabından&nbsp;Almanya&nbsp;hükümetine seslenen bir paylaşım yaptı.&nbsp;</p><p><strong>İmamoğlu şu ifadelere yer verdi:</strong></p><p>Basından öğrendiğim kadarıyla, Silivri’ye hapsedilmemiz üzerine, Alman Hükümeti hava kuvvetlerimizin büyük ihtiyacı olan ve uzun zamandır beklediğimiz Eurofighter savaş uçağının Türkiye’ye satışını veto etmiş. Almanya’da görevi devralmaya hazırlanan yeni hükümete seslenmek istiyorum: Türkiye Erdoğan’dan ibaret değildir, Türkiye Erdoğan’dan büyüktür. Hükümetler gelip geçicidir.</p><h2>\"Bu kararınızı geri almanızı istirham ediyorum\"</h2><p>Türkiye’nin ulusal çıkarları Erdoğan’dan da İmamoğlu’ndan da daha değerlidir. Bu kararınızı geri almanızı istirham ediyorum. Erdoğan iktidarının sonu göründü. Türkiye’nin yeni iktidarı, Avrupa Birliğiyle ve Almanya dahil bütün müttefiklerimizle, karşılıklı menfaatlerimiz, hukukun üstünlüğü ve insan haklarına dayalı demokrasi ilkeleri çerçevesinde çalışacaktır. Bizim iktidarımızda Türkiye’nin AB’ye tam üye olacağına dair en ufak bir şüphemiz yoktur.</p><p>Almanya’nın önde gelen ekonomi gazetelerinden Handelsblatt, Alman hükümetinin Türkiye’ye Eurofighter Typoon tipi savaş uçaklarının satışını İstanbul Büyükşehir Belediye (İBB) Başkanı Ekrem İmamoğlu’nun tutuklanması nedeniyle veto ettiğini&nbsp;yazdı. Gazete, haberini hükümet içinden yapılan gizli görüşmelere katılan birçok kaynağa dayandırdı. Haberde, Sosyal Demokrat Parti (SPD) ile Yeşiller koalisyonunun bu kararı ortaklaşa aldığı belirtildi.</p><p>Habere göre İmamoğlu’na yönelik yargı süreci, Alman hükümetince “Türk demokrasisine saldırı” olarak değerlendirildi. Bu nedenle, hükümetin Türkiye’ye yönelik silah satışını durdurmayı uygun bulduğu ifade edildi.</p><p>Handelsblatt, Türkiye’ye Eurofighter ihracatının mayıs ayında görevi devralacak yeni koalisyonu da zorlayacağını öne sürdü.</p>","contentLength":1998,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k4lebu/ekrem_imamoglu_erdogans_end_has_appeared_turkeys/"},{"title":"Nigel Farage defends allowing US chlorinated chicken into UK as part of trade deal","url":"https://www.theguardian.com/politics/2025/apr/20/nigel-farage-defends-allowing-us-chlorinated-chicken-into-uk-as-part-of-trade-deal","date":1745259200,"author":"/u/Xenon1898","guid":500,"unread":true,"content":"<p>Nigel Farage has defended allowing labelled chlorinated chicken from the US into the UK as part of a trade deal, as a poll suggested his Reform UK party could be on course to take the highest number of seats at a general election.</p><p>Speaking before the local elections in <a href=\"https://www.theguardian.com/uk-news/england\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">England</a> on 1 May, Farage said British consumers already ate chicken from places such as Thailand reared in poor conditions, and accepted chlorine-washed lettuce.</p><p>He told the <a href=\"https://www.thetimes.com/uk/politics/article/nigel-farage-reform-unions-nationalisation-deportations-gb5d5r97s\" data-link-name=\"in body link\">Sunday Times</a>: “If you have a look at the chicken we are currently importing from Thailand, you look at the conditions they’ve been reared in, and that every single bag of pre-made salad in every single supermarket has been chlorinated … once those basics have been accepted I’ll have a debate with you.”</p><p>Asked how he would prevent British chicken farmers being undercut by cheap producers from the US, he said: “I want to promote British farming as being a high-end product. I think the growth of farmers’ markets, they are a much more discerning audience that wants to know where their meat comes from. I don’t think British farmers have anything to fear from this long term.”</p><p>Both the government and the Conservatives have objected to US demands for its producers to be able to sell chicken with <a href=\"https://www.theguardian.com/environment/2025/apr/17/rural-communities-could-be-destroyed-if-uk-signs-us-trade-deal-says-former-food-tsar\" data-link-name=\"in body link\">lower welfare standards</a> in the UK. Britain does not allow imports of products such as chlorine-washed chicken and hormone-injected beef and Donald Trump has been pushing for agriculture to be part of a trade deal if the UK wants tariffs to be lowered on its exports such as cars and steel.</p><p>In the interview in Lancashire, where <a href=\"https://www.theguardian.com/politics/2025/apr/18/may-local-elections-conservatives-reform-what-to-look-for\" data-link-name=\"in body link\">Reform is challenging</a> both the Tories and Labour for council seats, Farage also spoke about his rift with Trump’s adviser the US billionaire Elon Musk, who had been pushing for him to take a harder line on immigration and support the far-right figure Tommy Robinson.</p><p>He said he had been in contact with Musk since their spat on X, but added: “I’ve fought against this for 25 years. You can’t bully me, I know what I think is right and what I think is wrong. Nobody pushes me around – not even him.”</p><p>Reform is hoping to take hundreds of seats off the established parties at the local elections, with a three-way split in the polls between Farage’s party, Labour and the Tories.</p><p>Keir Starmer’s Labour is narrowly ahead in most surveys. However, an MRP poll by More in Common found this weekend that Reform could win more seats than the other parties at a general election even if it has a slightly lower vote share.</p><figure data-spacefinder-role=\"inline\" data-spacefinder-type=\"model.dotcomrendering.pageElements.NewsletterSignupBlockElement\"><a data-ignore=\"global-link-styling\" href=\"https://www.theguardian.com/politics/2025/apr/20/nigel-farage-defends-allowing-us-chlorinated-chicken-into-uk-as-part-of-trade-deal#EmailSignup-skip-link-10\">skip past newsletter promotion</a><p tabindex=\"0\" aria-label=\"after newsletter promotion\" role=\"note\">after newsletter promotion</p></figure><p>The poll looking at constituency-level splits surveyed 16,000 people, with its model suggesting 180 seats for the Reform party on 23.7% of the vote, 165 for the Tories on 24.3% of the vote and 165 for Labour on 24.5%. It indicated 67 seats for the Lib Dems on 13.3% of the vote and 35 for the SNP on 2.2%.</p><p>Its modelling suggested that if a general election were held now then Labour could lose 246 seats, including 10 cabinet ministers, with losses to Reform in the <a href=\"https://www.theguardian.com/politics/2025/apr/15/nigel-farage-reform-is-parking-its-tanks-on-labours-lawn\" data-link-name=\"in body link\">”red wall”</a> and <a href=\"https://www.theguardian.com/politics/2025/apr/10/reform-uk-could-overtake-welsh-labour-2026-senedd-vote\" data-link-name=\"in body link\">Welsh valleys</a>, and to the SNP <a href=\"https://www.theguardian.com/politics/2025/feb/19/scottish-labour-2026-election-challenge-win-anas-sarwar\" data-link-name=\"in body link\">in Scotland</a>.</p><p>The poll also indicated Labour was being squeezed from both sides, with progressive voters looking to the Lib Dems, Greens and independents causing seats to be lost to the right.</p><p>The polling suggests the main parties could be on course for difficult local elections on 1 May, although they are hard to forecast on account of the often low turnout.</p>","contentLength":3437,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k4kd65/nigel_farage_defends_allowing_us_chlorinated/"},{"title":"After seizing control of the US government, the Heritage Foundation turns its attention to the EU","url":"https://yorkshirebylines.co.uk/politics/right-wing-push-to-dismantle-the-eu-heritage-foundations-private-workshop/","date":1745255338,"author":"/u/Morgentau7","guid":504,"unread":true,"content":"<p><strong>A private workshop took place on 11 March 2025 in Washington DC, hosted by the </strong><a href=\"https://www.britannica.com/topic/Heritage-Foundation\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"></a><strong>, to discuss proposals by European right-wing lobby groups to dismantle the European Union and the European Court of Justice.</strong></p><p>The Heritage Foundation, authors of <a href=\"https://en.wikipedia.org/wiki/Project_2025\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">Project 2025</a> – which is seen by many as the blueprint for the policies being enacted by the current Trump administration – welcomed right-wing thinktanks and lobby groups from Hungary and Poland. They debated the contents of a paper with a title <a href=\"https://time.com/collection/great-reset/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">stolen in part </a>from the World Economic Forum ‘The Great Reset: Restoring Member State Sovereignty in the 21st Century’.</p><h2><strong>The attendees: a right-wing alliance</strong></h2><p>As the meeting was a private one, there isn’t an official list of attendees; but <a href=\"https://vsquare.org/heritage-foundation-mcc-ordo-iuris-russia-european-union-european-court-of-justice/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">VSquare</a>, a Central European news platform, obtained a copy of an invitation to the event which provided important details of the meeting. It is known to have featured contributions from two prominent right-wing organisations: Hungary’s largest private educational institution with a Brussels-based thinktank, Mathias Corvinus Collegium (MCC), and the Polish Ordo Iuris Institute for Legal Culture. Also participating was the American Christian legal activist group, Alliance Defending Freedom (ADF).</p><p>On the menu<a href=\"https://vsquare.org/heritage-foundation-mcc-ordo-iuris-russia-european-union-european-court-of-justice/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"> were suggestions</a> to rename the European Union the ‘European Community of Nations’ as a symbolic gesture to mark an end to the existence of the EU, the weakening of the European Commission, and the neutering of the European Court of Justice.</p><p>All three groups present are highly connected to the political leadership of their respective countries, and they all have something in common: a firm belief in reducing the role of government, controlling the judiciary and installing a conservative religious approach in terms of access to reproductive healthcare for women, divorce and same-sex marriage.</p><h2><strong>Origins of the Heritage Foundation</strong></h2><p>The Heritage Foundation was created in 1973 by Joseph Coors, Paul Weyrich and Edwin Feulner. Coors, of the Coors brewery dynasty <a href=\"https://corporations.org/corplist/coors/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">known for its</a> union-busting, anti-environmental and anti-equal rights stances, provided the finance. Weyrich, infamous<a href=\"https://www.au.org/the-latest/articles/why-christian-nationalists-dont-want-you-to-vote/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"> for stating that</a> he ‘didn’t want everyone to vote’ and that he sees theocracy as the preferred system of government, recruited the Christian right vote. And <a href=\"https://en.wikipedia.org/wiki/Edwin_Feulner\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">Feulner</a>, as a congressional aide to congressman and former secretary of state for defence Melvin Laird, facilitated political access.</p><p>They created a thinktank promoting a fusion of social conservatism, small government and Catholic-influenced Christian evangelicalism which, in a relatively short period of time, went on to become one of the most predominant political influences in US politics.</p><p>Its current leader, and architect of Project 2025, Kevin Roberts, has close links with <a href=\"https://www.abc.net.au/news/2023-01-30/what-is-opus-dei-secretive-catholic-church-group-prelature/101905802\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">Opus Dei</a>, a small but powerful organisation within the Catholic Church. He<a href=\"https://www.theguardian.com/us-news/article/2024/aug/09/kevin-roberts-abortion-slavery-holocaust-project-2025-trump?CMP=Share_iOSApp_Other\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"> has compared abortion</a> to slavery, lynchings, the Holocaust, antisemitic violence and terrorism.</p><p>His <a href=\"https://www.theguardian.com/us-news/article/2024/jul/26/kevin-roberts-project-2025-opus-dei?CMP=Share_iOSApp_Other\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">core beliefs have</a> long included support for the total banning of birth control, the dismantling of the Department of Education and ending of diversity, equity and inclusion initiatives. Two of these goals have already begun to be achieved within the first eight weeks of Donald Trump’s second term.</p><h2><strong>Mathias Corvinus Collegium: from scholarships to propaganda</strong></h2><p>The MCC started out as a relatively modest foundation offering scholarships and support to talented students. In 2020, things changed when Viktor Orbán <a href=\"https://www.nytimes.com/2021/06/28/world/europe/hungary-orban-university.html?smid=nytcore-ios-share&amp;referringSource=articleShare\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">government gifted over</a> £1.3bn in state funding and shares in oil and pharmaceutical companies to the organisation. This injection of cash fuelled a massive expansion in reach and an ideological alignment with Orbán’s nationalist and socially conservative policies.</p><p>It now plays a significant role in Hungary’s educational and cultural landscape, described<a href=\"https://cz.boell.org/en/2024/08/08/whitewashing-orbans-image-and-ideas-brussels\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"> by some as a propaganda arm</a> of the government with opaque funding. It also aims to open centres in Berlin, Vienna and London.</p><h2><strong>Ordo Iuris: crusading for control</strong></h2><p>Ordo Iuris is an ultra-conservative, <a href=\"https://balkaninsight.com/2021/06/22/ordo-iuris-the-ultra-conservative-organisation-transforming-poland/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">Catholic-leaning, Polish thinktank</a> founded in 2013 and closely tied with the Law and Justice party which, until recently, was the governing party in Poland.</p><p>One of the major reasons Law and Justice lost the election was the stance it took, in accordance with Ordo Iuris-devised policy, against the reproductive health rights of women, LGBT rights and divorce. Ordo Iuris drafted a bill entirely criminalising abortion which sparked nationwide protests in 2016 and, though eventually abandoned by the Polish parliament, the group went on to successfully push for a watered down version which has <a href=\"https://balkaninsight.com/2021/06/22/ordo-iuris-the-ultra-conservative-organisation-transforming-poland/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">effectively banned abortion</a> in Poland since 2020.</p><h2><strong>Alliance Defending Freedom: a legal weapon</strong></h2><p>The ADF is an American legal advocacy group which campaigns outside women’s healthcare centres, and<a href=\"https://www.hrc.org/news/alliance-defending-freedom-staunch-enemy-of-equality\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"> drafts bills to encourage</a> lawmakers to restrict abortion and minority rights. Founded in 1994 by two male Christian evangelicals, James Dobson and Bill Bright, they use their substantial financial clout to implicate themselves in legal cases to restrict women’s access to reproductive healthcare. Examples include <a href=\"https://www.plannedparenthoodaction.org/issues/birth-control/burwell-v-hobby-lobby\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">Burwell v Hobby (2014), which </a>denied millions of women medical insurance cover for contraception, and the catastrophic Dobbs v Jackson Women’s Health Organization (2022) which effectively ended women’s universal right to an abortion in the USA.</p><p>They are now working on <a href=\"https://www.newyorker.com/magazine/2023/10/09/alliance-defending-freedoms-legal-crusade\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">extending the reach </a>of the Dobbs case to restrict legal rights to contraception, same-sex marriage and homosexual acts. Mike Johnson was <a href=\"https://truthout.org/articles/new-house-speaker-mike-johnson-used-to-be-top-counsel-for-anti-lgbtq-hate-group/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">previously legal counsel </a>and senior spokesperson for the group. He is now speaker of the house and second in line for the presidency of the USA.</p><p>These groups have long been interconnected. Hungary regularly hosts <a href=\"https://www.independent.co.uk/news/world/americas/us-politics/cpac-conference-conservative-republican-trump-b1805737.html\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">Conservative Political Action Conference</a> events, the<a href=\"https://www.hungarianconservative.com/articles/politics/cpac-2025-jd-vance-balazs-orban-migration-free-speech-united-states-trump/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"> next scheduled for</a> May, and the ADF provides financial support to anti-abortion campaigners across Europe on a regular basis. The 2022 arrest in Bournemouth <a href=\"https://www.newyorker.com/magazine/2023/10/09/alliance-defending-freedoms-legal-crusade\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">of Adam Smith-Connor</a>, cited by JD Vance at the Munich Security Conference in February as proof of British descent into authoritarianism, was heavily publicised by the ADF who funded his (unsuccessful) legal defence.</p><p>The Heritage Foundation is a member of the <a href=\"https://www.desmog.com/atlas-economic-research-foundation/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">Atlas Network</a> of right-wing thinktanks with strong <a href=\"https://www.desmog.com/2024/08/14/project-2025-tory-candidates-ties-heritage-foundation-donald-trump-robert-jenrick-priti-patel/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">connections to the British right </a>and the equivalent lobby groups associated with <a href=\"https://www.bbc.co.uk/news/uk-politics-63039558\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">55 Tufton Street. </a>Liz Truss, Robert Jenrick, Priti Patel, Matt Goodwin and Nigel Farage are all contributors to Heritage Foundation events, and in 2023 we were treated to the bizarre spectacle of Conservative politicians putting on<a href=\"https://yorkshirebylines.co.uk/politics/why-are-backbench-conservative-mps-aping-alabama-republicans/\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"> an evangelical Easter display </a>on Twitter (now X) which, although it seemed out of place in modern Britain, would warm the heart of every Republican Christian nationalist in America.</p><p>The Great Reset<a href=\"https://vsquare.org/wp-content/uploads/2025/03/MCC-Ordo-Iuris-Factsheet.pdf\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\"> fact sheet</a> discussed at the March workshop in Washington DC, suggests employing the same arguments used against the EU by British Eurosceptics in 2016 – sovereignty, unelected bureaucrats and foreign courts – to foster nationalist and isolationist sentiments across the continent.</p><h2><strong>Attacking the EU to erase 20th-century progress</strong></h2><p>This radical right ideology fused with Christian and Catholic fundamentalism seeks to redirect western society away from the 20th-century gains of social protections and civil rights back to a 19th-century structure with strict social norms and governments reduced to a role of protecting private property, providing police, courts and military services primarily for the privileged. A vision where the ultra-rich would live a gilded existence free from the restrictive burdens of taxation and regulation, while the majority eke out an existence in a workplace with no protections, spending Sundays at church, with women pushing out children they can’t afford and for whom there is no healthcare and little education, and the only accepted form of love is heterosexual.</p><h2><strong>The dystopian New World Order</strong></h2><p>Elon Musk’s Department of Government Efficiency performatively enacts its destruction of the administrative state in the USA with dubious legality and offers fantastical and distracting promises of life on Mars. Trump <a href=\"https://news.sky.com/story/donald-trump-says-eu-was-formed-to-screw-the-united-states-and-threatens-25-tariffs-13317606\" target=\"_blank\" rel=\"noopener nofollow\" title=\"\">opines that the </a>EU was formed to “screw the United States”, and the powerhouse behind the president and his programme is now turning its malign attention to Europe.</p><p>This month in Washington DC, plans were being laid.</p><p>The vast majority of humanity looks upon Trump and his acolytes as a global disaster. A country whose citizens have been raised on a diet of American exceptionalism, who think they have won every war, whether true or not, and which constantly sees itself as the good guy, might not appreciate attacking its allies and rubbing shoulders with dictators.</p><p>In Europe we are waking up to the misinformation campaigns from which we are no longer protected by outlets who call themselves ‘platforms’ to avoid the legal responsibilities of publishers, which is what, in reality, they are.</p><p>Europe must be on its guard. Extreme vigilance is required. We have to believe that good will prevail.</p><p>But for now, sadly, that excludes the USA.</p>","contentLength":9062,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k4ipm1/after_seizing_control_of_the_us_government_the/"},{"title":"According to the French Space Command, France is monitoring three new Russian satellites, one of which has released a mysterious object.","url":"https://www.leparisien.fr/sciences/la-france-scrute-trois-nouveaux-satellites-russes-dont-lun-a-libere-un-mysterieux-objet-11-04-2025-EDXRRWYHTVHD7ML2O66A4ZSM54.php","date":1745253761,"author":"/u/UpgradedSiera6666","guid":497,"unread":true,"content":"<section><p>Lancés le 5 février depuis le cosmodrome de Plesetsk en Russie avec un troisième engin, Kosmos 2583, le couple métallique s’est rapproché dangereusement une première fois trois semaines plus tard. Ces manœuvres ont attiré l’attention des observateurs du trafic spatial, qui savent que flirter ainsi en orbite fait courir le risque de collisions en chaîne, comme dans le film « Gravity ».</p></section>","contentLength":402,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k4i0x7/according_to_the_french_space_command_france_is/"},{"title":"25% of Teenage boys in Norway think 'gender equality has gone too far' with an extremely sharp rise beginning sometime in the mid 2010s","url":"https://www.reddit.com/r/europe/comments/1k4hf0h/25_of_teenage_boys_in_norway_think_gender/","date":1745252329,"author":"/u/Antique-Entrance-229","guid":505,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"It is now or never: Eurobonds and a European stockmarket","url":"https://institutodeanalistas.com/eurobonds-a-brief-note-on-economic-merits-and-drawbacks/","date":1745239904,"author":"/u/apegen","guid":499,"unread":true,"content":"<p>The recent European sovereign debt crisis has shown how vulnerable the euro zone is under a functioning system in which the monetary policy is set up at the European Union level, while fiscal policy is carried out at the national levels. However, the EU, a project still under construction, should have the capacity to create solutions.</p><p>In this vein, the President of the European Central Bank (ECB) pledged to do “whatever it takes” to preserve the survival of European Monetary Union (EMU), and he did. Several non-conventional monetary policy measures were implemented to address not only the risks of a too prolonged period of low inflation, but also to tackle the euro sovereign debt crisis. Purchases of government bonds by the ECB was also justified to ensure price stability in the euro area, since a currency can only be stable if its continued existence is not in doubt (Asmussen, 2013).</p><p>In May 2010, the ECB announced the Securities Markets Programme (SMP), whose main target consisted of lowering the interest rates of euro members in financial distress. It resulted in ECB purchases of government bonds in the secondary markets, and thus in an increase of those countries bonds’ prices. According to some commentators, by doing so the ECB would have intervened in the market forces (Helm, 2012). Later, in July 2012, the Governing Council of the ECB announced the Outright Monetary Transactions Programme (OMT). In spite of its technical features, their critics claimed that the ECB had breached its mandate by announcing potentially unlimited sovereign bond purchases. For some authors, by implementing the OMT Programme the ECB had exceeded monetary measures marks and interfered into the terrain of fiscal policy. This would have resulted in a violation of Art. 123 of the Treaty on the Functioning of the European Union (TFEU), according to which monetary financing of sovereign entities is strictly prohibited. Additionally, they claim that political independence of the ECB could have been put in danger. In the same way, the German Federal Court (Bundesverfassungsgericht or BVerfG), putting into doubt the legality of the OMT, decided to refer for the first time a case to the Court of Justice of the European Union (CJEU). The BVerfG’s judgment strongly implied that the OMT program was an act of economic policy, therefore outside the monetary mandate of the ECB, because of its objective, the selectivity of the potential purchases and the risk to compromise the functioning of European Stability Mechanism (ESM). (Pennesi, 2016). In the aftermath of these disputes, in March 2015 the Eurosystem started buying government bonds under a new mechanism, the Public Sector Purchase Programme (PSPP), which to the current date is still in place.</p><p>However, unconventional monetary policy has not been the only solution tabled to solve the European sovereign crisis:</p><p>On the one hand, since the euro zone was conceived as a monetary union without a fiscal union, it has been proposed to achieve a much deeper fiscal integration among euro members. This would imply an extended government budget at the EU level, combined with an EU tax system (Fuest and Peichl, 2012), and the creation of a European finance minister (EU-FM), (Enderlein and Haas, 2015). Others consider that an extension of the fiscal powers of «Brussels» would be politically unacceptable, since it would put at risk the democratic principle of <i>no taxation without representation</i>.</p><p>On the other hand, some economists claimed that an orderly procedure to restructure the debt of an insolvent member estate, as well as a fiscal insurance mechanism were indispensable to protect taxpayers in other euro zone, in the event of debt restructuring (Dolls et al., 2016).</p><p>Finally, the German Council of Economic Experts proposed the European Redemption Pact (ERP) as an alternative strategy for exiting from the EU debt crisis. This pact would include a binding commitment by all participating countries to bring public debt ratios below the reference value of 60% within the next 20 to 25 years. To ensure that this objective might be reached with realistic primary balances, participating countries could transfer their debt exceeding this threshold into a redemption fund for which participating member countries were jointly and severally liable (German Council of Economic Expert, 2011; Parello and Visco, 2012; and Doluca et al., 2012).</p><p><strong>2. The Eurobonds as an alternative tool</strong></p><p>An alternative solution (compatible with the existence of a fiscal union) would consist of pooling some fiscal risks. Unifying national debts and creating Eurobonds have been viewed as a tool for not only boosting integration and the efficiency of financial markets in the euro area, but also as a potentially powerful instrument to solve the European sovereign debt crisis.</p><p>According to its standard design, this debt instrument could be issued by a newly created common European Fiscal Authority or European Debt Management Agency, and would be jointly and severally backed by all countries members of the euro zone. However, this design has not been unique. Multiple Eurobond designs have been proposed: EMU Fund Bonds (Boonstra, 2005 and 2011); Financial Stability Fund Bonds (Gros and Micossi, 2008); European Investment Bank Bonds (De Grauwe and Moesen, 2009); European Monetary Fund Bonds (Mayer, 2009); Blue-Red Bonds(Delpha and Von Weizsäcker, 2010); European Debt Agency Bonds (Tremonti and Juncker, 2010); European Safe Bonds or ESBies (Brunnermeier et al., 2012); Synthetic Eurobonds (Beck et al., 2011); Trichet Bonds (Economides and Smith, 2011); Eurobills (Hellwig and Philippon, 2011 and Bishop, 2013); Partial Insured Sovereign Bond (Dübel, 2011); Revised Blue Bonds (Gopal and Pasche, 2012); and Structured Eurobonds (Hild et al., 2012). Note that these designs greatly differ in their scope, goals, tenor of the debt, level of intergovernmental commitment, extent of solidarity, degree of legal and institutional obstacles, as well as the feasibility of implementation roadmaps.</p><p>Important institutional and legal obstacles have become apparent to make progress in the direction of creating a European common bond but in this brief note, we focus in particular on the economic advantages and drawbacks of introducing such instrument.</p><p><strong>2.1. Advantages of introducing Eurobonds</strong></p><p>Many reports have been published on the possible pooling of sovereign issuance in the euro area and there is a widespread consensus that the introduction of a common supranational Eurobond would imply several merits. The following have been particularly highlighted:</p><ol type=\"a\"><li>A tool to resolve the eurozone debt crisis. Eurobond is a mechanism to buy time by reducing the degree to which heavily indebted countries need to apply short-term austerity measures. Implementing such a common public debt in the EU area could reduce risks of recession and facilitate faster economic growth for the whole region.</li><li>A way of stopping speculative attacks. Sometimes, psychological fears that certain member states are or may become insolvent, initiate inefficient speculative attacks: the markets demand a risk premium that raises the cost of refinancing these bonds and depresses their prices, generating a sovereign debt crisis. The introduction of Eurobonds might contribute to break this loop.</li><li>A method to reduce public debt yields of those member estates in financial stress. Due to the higher liquidity and ease of trading of Eurobonds, investors and traders would be willing to accept lower yields. By reducing interest payments governments could reduce their future budget deficits. As a result, public debt sustainability would improve in the euro-zone.</li></ol><p>In addition, a number of merits arising from introducing European common bonds have been stood out in connection with financial issues:</p><ol type=\"a\"><li>Mitigating bank-sovereign crisis loop. Historically, banks and sovereigns have been indissolubly tied together. The vicious cycle between banking and sovereign crisis has been a salient feature of the recent eurozone crisis. The conversion of euro area national debts into a common eurozone debt would benefit the banks in Europe, break this strong interdependence and help put a stop to the banking crisis.</li><li>Creating a new safe asset. Due to its increased depth, breadth and liquidity, investors would increase their demand of Eurobonds for investment and precautionary purposes, just as they presently do with US Treasuries. Thus, the introduction of Eurobonds would generate a seigniorage effect in the euro zone.</li><li>A deeper public debt market in Europe. The creation of Eurobonds would transform the currently fragmented European capital market for sovereign bonds into one single and vast European Government bond market.</li><li>Solidifying the euro as a global reserve asset. The creation of a single debt instrument traded in a vast market could reinforce the euro as a means of payment instrument, and as currency for official store of value purposes (a reserve currency that central banks choose to hold their savings in).</li></ol><p><strong>2.2. Drawbacks arising from the introduction of Eurobonds</strong></p><p>So far, governments in the euro area are individually responsible for the debt they have issued. According to the no bail-out clause (Art. 125 of the TFEU) it is prohibited for the EU or any of the national governments to assume responsibility for the debt issued by another member state (Pisani-Ferry, 2012). Thus, the creation of some type of Eurobonds could require a reform in the TFEU, but beyond this legal obstacle, there also some economic problems that introducing Eurobonds might mean for the Eurozone. A wide academic literature exist on disadvantages of pooling fiscal risks in a scenario in which public sector debt ratios are very different by country:</p><ol type=\"a\"><li>Adverse selection. The introduction of Eurobonds might raise the interest rates at which the most creditworthy euro members currently pay on their debt. This could lead to a rejection of Eurobonds by highly solvent countries, but this refusal to participate would imply the uselessness of the Eurobond mechanism itself.</li><li>Free riding. A model of fiscal risk pooling could force the more frugal countries to start paying for prodigal countries’ deficits. Fiscally prudent members might be penalized for other members’ dissipation. If in this scenario, currently very solvent countries change its fiscal policy profile, gradually over time, eurozone countries could face the raise the debt-GDP ratio for the entire region, resulting in undesired credit rating cuts and increases in debt yields.</li><li>Moral hazard. It relates to the fear that countries’ “bad” behavior in overspending and accumulating debt would be rewarded through a government bailout. The introduction of Eurobonds might reduce incentives to perform fiscal austerity policies in the future. If highly indebted countries were rescued, their fiscal policy behavior would tend to be more lax. Moreover, if governments with high public debt ratios may finance themselves at low yields the incentives to carry out budget discipline measures vanish. It would foster the illusion that is possible for a country to get out of financial difficulties without undertaken fundamental reforms.</li><li>Losing signaling role of financial markets. Issuing Eurobonds would remove the disciplining effect of capital markets on the ability of member states to issue more debt.</li><li>Fiscal sovereignty loss. Previous fiscal constraints, that are required for a proper functioning of a joint issuance mechanism, would eliminate each country’s ability to control its interest cost burden and would reduce its sovereignty in fiscal matters.</li><li>Loss of liquidity at the national public debt markets. If the Eurobond market is to be added to the existing national public debt markets, instead of substituting them, the opposite effect to the wished might occur. We could witness an increase in the level of market fragmentation, as well as a loss of liquidity at the national public debt markets with respect to the current situation.</li></ol><p>Designers of European common debt systems have proposed alternative mechanisms aimed at restoring the disciplinary role of the market within the euro zone following the introduction of the Eurobonds. Avoiding the effect of free riding problems arising from the introduction of Eurobonds implies finding a way to ensure that one country’s profligacy will not spill over to another country’s debt burden; and therefore, ensuring that member states assume the responsibilities of their own fiscal policies. Moreover, introducing European common debt issuances will require finding a way to neutralize the moral hazard problem within the euro zone, and to internalize the signalling and disciplining force of the market. In short, to succeed the introduction of Eurobonds would require to enshrine fiscal discipline in a fair and credible way, as well as creating the right incentives for countries to maintain debt ratios at manageable levels.</p><p>Beck, T., Uhlig, H., and Wagner, W. (2011) “Insulating the financial sector from the European debt crisis: Eurobonds without public guarantees”, VoXEU. org, 17 CEPR’s Policy Portal. Boonstra, W.W. (2005) “Towards a better Stability Pact, Intereconomics, 40 (1): 4- 9.<p> Boonstra, W.W. (2011) “Can eurobonds solve EMU’s problems? Rabobank Economic Research Department.</p> Brunnermeier, M. K., Garicano, L., Lane, P. R., Pagano, M, Reis, R., Santos, T, Van Nieuwerburgh, S., and Vayanos, D.(2012) “European Safe Bonds (ESBies)”, mimeo.<p> De Grauwe, P. and Moesen, W. (2009) “Gains for all: a proposal for a common euro bond”, Intereconomics, 44(3): 132-135.</p> Delpa, J. and von Weizsäcker, J. (2010) “The blue bond proposal”, Bruegel Policy Brief, 3.<p> Dolls, M., Fuest, C., Heinemann, F. and Peichl, A. (2016) “Reconciling insurance with market discipline: a blueprint for a European Fiscal Union”. CESifo Working Paper, 5767.</p> Doluca, H., Hübner, M. Dominik, R. and Benjamin, W. (2012) “The European Redemption Pact: an illustrative guide”, Sachverständigenrat zur Begutachtung der Gesamtwirtschaftlichen Entwicklung, 02.<p> Dübel, H. J. (2011) “Partial sovereign bond insurance by the eurozone: A more efficient alternative to blue (Euro-) bonds”, CEPS Policy Brief, 252.</p> Economides, N and Smith, R.C. “Trichet Bonds To Resolve the European Sovereign Debt Problem” Networks, Electronic Commerce, and Telecommunications (“NET”) Institute Working Paper, 1.<p> Enderlein, H. and Haas, J. (2015) “What would a European Finance Minister do? A proposal” Jacques Delors Institute Policy Paper, 145.</p> Fuest, C. and Peichl, A. (2012) “European Fiscal Union: what is it? does it work? and are there really ‘no alternatives’?” IZA Policy Paper, 39.<p> German Council of Economic Expert (2011) “Assume responsibility for Europe” Annual Report, 12.</p> Gopal, M. and Pasche, M. (2012) “Market-based Eurobonds Without Cross-Subsidisation” Working Papers on Global Financial Markets, 37.<p> Hellwig, C. and Philippon, T. (2011), ‘Eurobills, not Eurobonds’, Voxeu.org, 2 CEPR’s Policy Portal, December.</p> Helm, L. (2012) The ECB’s securities markets programme – An analysis of economics, law and central bank independence. Brugge: College of Europe.<p>Hild, A., Herz, B. and Bauer, C. (2012) “Structured Eurobonds”, Universität Bayreuth Dicussion Paper, 7.</p> Mayer, T. (2009) “The case for a European Monetary Fund”, Intereconomics, May/June<p> Pennesi, F. (2016) “The impossible constitutional reconciliation of the BVerfG and the ECJ in the OMT case. A legal anaylisis of the first preliminary referral of the BVerfG”, Perspectives on Federalism, 8(3):3-21.</p> Pisani-Ferry, J. “The Euro crisis and the new impossible trinity”, Bruegel Policy Contribution, 01: 1-14.<p> Gros, D. and Micossi, S. (2008) “A call for a European Financial Stability Fund” in The First Global Financial Crisis of the 21st Century, Part II June-December 2008 (Ed.)Andrew Felton and Carmen M. Reinhart.</p> Tremonti, G. and J.C. Juncker 2010 “E-bonds would end the crisis” The Financial Times, 5 December.</p><p>Licenciado y Doctor en Economía (Universidad Complutense de Madrid) y Master of Science in Economics (University of York). Profesor Titular de Economía Aplicada VI (UCM). Autor de varios libros y artículos sobre finanzas, fiscalidad, deuda pública y política fiscal en Revista de Economía Aplicada , Journal of Public Administration, Finance and Law, Hacienda Pública, Revista de Economía Pública, y otras.</p>","contentLength":16506,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k4cqqd/it_is_now_or_never_eurobonds_and_a_european/"},{"title":"Anti-Trump protesters in the US might look to the Czech Republic: ‘We are an example’ | Massive, sustained protests led to the 2021 downfall of billionaire oligarch Andrej Babiš, dubbed ‘the Czech Trump’","url":"https://www.theguardian.com/us-news/2025/apr/20/trump-protesters-czech-republic","date":1745227597,"author":"/u/DifusDofus","guid":498,"unread":true,"content":"<p>A former cold war communist dictatorship and component part of the Habsburg empire seems an unlikely source of hope for <a href=\"https://www.theguardian.com/us-news/donaldtrump\" data-link-name=\"in body link\">Donald Trump</a>’s opponents.</p><p>One such country, <a href=\"https://www.theguardian.com/world/hungary\" data-link-name=\"in body link\">Hungary</a>, is often cited as the model for Trump’s no-holds-barred authoritarian assault on US institutions. <a href=\"https://www.theguardian.com/world/viktor-orban\" data-link-name=\"in body link\">Viktor Orbán</a>, the central European country’s prime minister, has been a guest at the president’s Mar-a-Lago estate and has won Trump’s praise for transforming Hungary into an “illiberal state” that extols “traditional” values – and for projecting the kind of “strongman” persona the president admires.</p><p>Yet the contrasting political fate of one of Hungary’s near-neighbours with similar historical antecedents may provide a glimmer of hope for the prospects of mass protest laying foundations for a successful onslaught against Trump, leading to victory at the ballot box.</p><p>The <a href=\"https://www.theguardian.com/world/czech-republic\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Czech Republic</a> – once part of what was cold war-era Czechoslovakia and, coincidentally, birthplace of Trump’s first wife, Ivana – is a possible blueprint for how street protest can bloom into a unified electoral strategy that eventually unseats a billionaire leader with autocratic aspirations and apparent scorn for democracy.</p><p>In 2018, a popular movement, Million Moments for Democracy, began organizing rallies in the Czech capital, Prague, and other cities to protest the anti-democratic tendencies of the country’s prime minister, Andrej Babiš, who had been labelled “<a href=\"https://www.theguardian.com/world/2017/oct/21/andrej-babis-election-results-czech-republic\" data-link-name=\"in body link\">the Czech Trump</a>”.</p><p>Babiš, a billionaire oligarch who was the country’s second-richest person, had taken office as head of a coalition that relied on support from the remnants of the Czech communist party after his populist ANO (Action for Dissatisfied Citizens) party won the previous year’s election.</p><p>An even greater number turned up in November 2019, ostensibly to mark the 30th anniversary of communism’s collapse – which had itself been triggered by mass protests. The prime minister stood firm, and as the Covid-19 virus forced the country into prolonged lockdown, protests diminished and Babiš’s position seemed more assured, despite widespread discontent over his handling of the pandemic.</p><p>Yet in 2021 parliamentary elections, Babiš and his lavishly funded party <a href=\"https://www.theguardian.com/world/2021/oct/09/czech-pm-set-to-lose-power-after-weak-showing-in-general-election\" data-link-name=\"in body link\">were defeated by a five-party coalition</a> whose ideological differences were superseded by their hostility toward the prime minister.</p><p>The demonstrations, despite the lost momentum caused by Covid and Babiš’s stubborn refusal to resign even as police lodged criminal fraud charges, had worked by converting discontent into votes at the ballot box.</p><p>“We certainly had some role in the election results,” said Benjamin Roll, Million Moments for Democracy’s spokesperson and deputy leader at the time. “I believe we in the Czech Republic are an example of how long-term civic-society activities can bring, or help bring, political change.</p><p>“Those protests gave us all the feeling we have the power, that we were not alone, and we can do something. I think this emotion is really crucial.”</p><p>It is a potentially decisive factor amid swirling debate about how to respond to Trump as he has smashed long-established norms and assailed institutions at breakneck speed since his inauguration on 20 January.</p><p>While the leftwing Vermont senator, Bernie Sanders, and Alexandria Ocasio-Cortez, the progressive New York representative, have attracted vast crowds on their Fighting Oligarchy road tour that seems to emphasize the value of popular dissent, other Democrats have adopted a less confrontational approach, with some opting not to fight Trump at every turn.</p><p>The party’s leader in the senate, Chuck Schumer, <a href=\"https://www.theguardian.com/us-news/2025/mar/19/glenn-ivey-chuck-schumer-republican-funding-bill\" data-link-name=\"in body link\">drew fire</a> from many on his own side for leading a group of fellow Democratic senators in <a href=\"https://www.theguardian.com/us-news/2025/mar/23/chuck-schumer-democrats-funding-bill\" data-link-name=\"in body link\">voting for</a> a six-month Republican funding bill last month, averting a government shutdown.</p><p>The move sharpened criticism that congressional Democrats had reacted too passively to Trump’s authoritarian power grabs.</p><p>At the same time, the party’s exclusion from power in the White House and on Capitol Hill has prompted questions over the effectiveness of mass protests. The failure of demonstrations to translate into electoral defeat for authoritarian-type leaders in some countries – Hungary, Turkey and Serbia are recently cited examples – has fed such doubts.</p><p>However, Steven Levitsky, a politics professor at Harvard University and a specialist on authoritarian threats to democracy, said dismissing mass rallies as futile – which he called “a new conventional wisdom” after years of thinking they guaranteed a dictator’s downfall – was misplaced.</p><p>“Mass protest is less likely to bring down a government in a place where elections are a viable channel, meaning where it is still a democracy or near-democracy,” he said. “Protest is not going to lead to Donald Trump’s resignation, or Orbán’s, but that doesn’t mean it’s not relevant. <a href=\"https://www.theguardian.com/world/protest\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Protest</a> can weaken the government, can shape public opinion and the media framing and discourse, which is very important.”</p><p>At the “Hands Off” rally in Washington DC on 5 April, which <a href=\"https://www.theguardian.com/us-news/2025/apr/05/trump-hands-off-protest\" data-link-name=\"in body link\">drew tens of thousands</a> of people, participants said one aim was to embolden reticent voters and Trump critics who might be intimidated by the president’s blustering tactics.</p><p>Jiří Pehe, a Czech political analyst who is the director of New York University in Prague, said that message had its echoes in the Czech precedent.</p><p>“It was this overall, this strategy of waking people up and telling them: ‘Look, you have agency. You can change things. You are not just passive observers of what’s going on, but you can change things, but you have to be active,’” he said.</p><p>But allowing millions of dissatisfied Americans simply to vent their frustrations would not be enough, Pehe warned. “If the Czech Republic is to be an example, these demonstrations need to happen again and again across the United States and they need to have one or two strong messages. There has to be a very strong message towards the political class because only it can actually change things. And in this case, there should be pressure on the Democrats, saying: ‘Look, it’s your task to stop Donald Trump.’”</p><p>Speaking to the Guardian at the 5 April Washington rally, Jamie Raskin, a Democratic representative from Maryland who is the party’s top member of the House judiciary committee, said “a popular resistance strategy” featuring protests could only work in harness with “an effective legislative strategy”, a tall order since the Republicans control both the Senate and the House of Representatives.</p><p>“Ultimately, we’re going to have to win the elections next year, and when we take back the House and the Senate, we will be back in the driver’s seat,” he said.</p><p>That aim evokes another lesson from the Czech example, observers say: the need for the Democrats to take their cue from the demonstrators and put aside their ideological differences for the sake of unity.</p><p>“What you’ve seen in the Czech Republic is a broad array of political forces coming together to form a pro-democracy coalition and I think that’s instructive for the US,” said Norm Eisen, a former US ambassador to Prague and senior fellow at the Brookings Institution, who called for a “big tent” approach encompassing anti-Trump Republicans.</p><p>“They were for putting aside particular differences on partisan issues, on ideology. That is one of the critical ingredients for success, and I believe we are seeing that here. In these deportation disputes, we filed a brief at the supreme court by more than three dozen conservatives, [who served in] every Republican presidential administration, from Nixon to Trump 1, and I was the lawyer on that, together with a senior justice department official from the Bush administration.”</p><p>Levitsky said the US protests had assumed outsize importance given the failure of other institutions and pillars of the establishment – including major CEOs, law firms, the Catholic church and, until this week, universities – to mount a stand since Trump took office.</p><p>“This emerging protest movement, and the size of the crowds at the Bernie Sanders and AOC events, is going to compel Democratic politicians to become more active, follow their base rather than so as not to lose it,” he said. “What the protest movement can do is contribute to an erosion of Trump’s popularity, and embolden opposition politicians and probably contribute to an electoral outcome in a couple years.</p><p>“In that sense, these guys are not wasting their time. I think it’s a very, very important step in getting the opposition off the sidelines.”</p><p>Back in Prague, Roll – recalling the intoxication of the anti-Babiš rallies – had advice for US demonstrators: stay positive and, whatever Trump’s provocations, avoid hateful rhetoric – something he fears the US’s two-party system makes hard to avoid.</p><p>“The division in the United States is really dangerous because you see the other side as the enemy,” he said. “It’s crucial to remain non-violent and hopeful. Talking in front of lots of people, we realised you have to be careful about your language because if you are too negative or hateful, it can defeat your purpose. Remember that the other side are people. They’re your brothers and sisters.”</p>","contentLength":9305,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k49cfi/antitrump_protesters_in_the_us_might_look_to_the/"},{"title":"Pope Francis has died, Vatican says in video statement","url":"https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/","date":1745222406,"author":"/u/GeorgeTH281","guid":506,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k484ac/pope_francis_has_died_vatican_says_in_video/"},{"title":"Britain to ramp up explosives production to end reliance on US arms","url":"https://www.thetimes.com/article/7828a2dd-91ea-462c-8b86-63f681dc106b?shareToken=b90ad01a8ae191172a85ae16def4936c","date":1745220909,"author":"/u/tree_boom","guid":501,"unread":true,"content":"<p>“Strengthening homegrown artillery production is an important step in learning the lessons from <a href=\"https://www.thetimes.com/topic/ukraine\">Ukraine</a>, boosting our industrial resilience and making defence an engine for growth,” he said. </p><p>By the summer, BAE will have increased its production of 155mm rounds — the Nato-standard ammunition — 16-fold over two years to meet the demand fuelled by the Ukraine war. </p><p>The Times is aware of the number of rounds the UK can now produce but has been asked not to disclose it for security reasons.</p><p>Using a world-first innovative technique — amounting to the biggest shake up in explosive manufacturing in five decades — BAE now wants to produce its own sovereign explosives and market the technology across the globe. </p><p>Previously BAE Systems imported RDX explosives from two main sources, the US and France.</p><p>The company, the largest defence contractor in Europe, is hoping to reach a position where its munitions are deemed to be “Itar-free”, essentially without any US components or material so they can be used and sold on without being subject to any restrictions from America.</p><p>There are also fears that should a wider war break out, <a href=\"https://www.thetimes.com/comment/columnists/article/europe-ukraine-war-eu-6w9l60hf2\">western nations</a> will be scrambling to purchase and produce munitions, meaning the UK needs its own sovereign capability to produce explosives.</p><p>Francis Tusa, a defence analyst briefed on BAE’s plans, said: “If you don’t have the ammunition you can’t fight. This announcement shows someone has woken up to the fact that in times of stress the open market for ammunition disappears and having your own plants and ability to create raw explosives and propellant isn’t just a nice thing to have, it is a must have.”</p><p>Itar, which stands for the International Traffic in Arms Regulations, refers to a set of longstanding US rules that govern the items on the United States Munitions List aimed at safeguarding national security.</p><p>The list contains US-produced software, components and other technology which can be used for either military purposes or serve a dual purpose. If a weapon is subject to Itar, it cannot be built, sold or supplied to someone else, without US consent and support.</p><p>Trump’s tariff war, suspension of military and <a href=\"https://www.thetimes.com/article/us-suspends-intelligence-sharing-with-ukraine-fn3nc0bjx\">intelligence aid to Ukraine</a> and threats to Canada and Denmark have made British and European countries concerned about relying on US defence equipment in the future.</p><p>155mm rounds are currently used by the British Army in its Archer self-propelled howitzer and the AS-90 armoured self-propelled artillery.</p><p>BAE Systems is the only company in the UK to produce the 155mm rounds and much of the ammunition has been given to Ukraine, leaving the UK dangerously short.</p><p>Steve Cardew, the business development director at BAE Systems’ Maritime and Land Defence Solutions, said: “The whole challenge for our industry is around production scale up and creating enough industrial capacity to effectively match Russia and other hostile nations.”</p><p>In an interview with The Times, he explained that RDX explosives used in 155mm rounds, mortars and warheads were normally developed in a relatively inefficient large-scale facility, however European nations were struggling to produce explosives at scale.</p><p>Under the plans outlined by BAE, each individual shipping container will produce up to 100 tonnes a year of explosives on a much smaller scale but one that is more efficient, cheaper and quicker. It is also more resilient in terms of security, he explained. “One large facility is clearly a big security threat. If you have dispersed facilities, it is much more secure.”</p><p>The innovative technology the firm has developed, using automation, has been proven as a concept and BAE now plans to manufacture its own explosives at scale. The system will then be sold to other countries so they can also produce their own sovereign explosives.</p><p>At the moment, 155mm rounds or weapons produced with explosive material from the US are subject to Itar restrictions. Cardew said that in future BAE would be able to sell its products on the basis they are “Itar-free”.</p><p>He said the “global security scenario” had “forced” BAE to accelerate the development of its explosives work in an environment where there was more demand for munitions globally than there was the industrial base to supply it.</p><p>“Making sure we have our own access to our own supply chains is really important. We clearly have enough supply chain access for what we have today but going forward, continuing to rely on that will generate risk and therefore we are keen to make sure that the UK has its own supply chain,” he said.</p><p>Asked about concerns over Trump’s erratic behaviour, he said: “What is going on in the US is clearly one facet of a general view we have got that the world is becoming increasingly unstable and therefore we need to protect ourselves and our supply chain accordingly. I don’t think it is just about the US.”</p><p>He said the need for such unique technology was at an “all time high” and had “tremendous potential”.</p><p>Every day <a href=\"https://www.thetimes.com/topic/russia\">Russia</a> is firing about 12,000 rounds, compared with around 7,000 fired by the Ukrainians, according to Ukrainian military sources. Six plants in North Korea are now supplying Moscow with its ammunition, amounting to some 45 per cent of Russia’s needs, two sources said.</p><p>BAE will deliver the 16-fold increase in 155mm rounds when its new explosive filling facility at Glascoed, south Wales, becomes operational this summer.</p>","contentLength":5423,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/europe/comments/1k47s7m/britain_to_ramp_up_explosives_production_to_end/"}],"tags":["news","reddit"]}