{"id":"46aP2QbqUqBrWfYqAibo8xS24qkvbDNgWZV4Z6rf2nuJ3cBJ971pKb6XZkWhnDxr957c82fPU4Cg4j63MSkVSUXrPi55","title":"top scoring links : worldnews","displayTitle":"News - Reddit - World News","url":"https://www.reddit.com/r/worldnews/top/.rss?sort=top&t=day&limit=10","feedLink":"https://www.reddit.com/r/worldnews/top/?sort=top&t=day&limit=10","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":10,"items":[{"title":"US Imposes Tariffs Up to 3,521% on Southeast Asia Solar Imports","url":"https://www.bloomberg.com/news/articles/2025-04-21/us-imposes-new-duties-on-solar-imports-from-southeast-asia?embedded-checkout=true&amp;leadSource=reddit_wall","date":1745293431,"author":"/u/cryptodoggie26","guid":435,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k4wzsg/us_imposes_tariffs_up_to_3521_on_southeast_asia/"},{"title":"Carney urges Canadian doctors in the U.S. to come home","url":"https://nowtoronto.com/news/carney-urges-canadian-doctors-in-the-u-s-to-come-home/","date":1745276546,"author":"/u/Old_General_6741","guid":441,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k4rct4/carney_urges_canadian_doctors_in_the_us_to_come/"},{"title":"Venezuela accuses El Salvador of human trafficking as prisoners caught in row between authoritarians","url":"https://www.theguardian.com/world/2025/apr/21/venezuela-el-salvador-bukele-maduro-prisoners","date":1745268879,"author":"/u/Aggravating_Money992","guid":443,"unread":true,"content":"<p><a href=\"https://www.theguardian.com/world/venezuela\" data-link-name=\"in body link\">Venezuela</a>’s chief prosecutor has accused <a href=\"https://www.theguardian.com/world/el-salvador\" data-link-name=\"in body link\">El Salvador</a>’s president of being a “tyrannical” human trafficker after Nayib Bukele <a href=\"https://www.theguardian.com/world/2025/apr/21/el-salvador-president-nayib-bukele-prisoner-swap-venezuela\" data-link-name=\"in body link\">offered to exchange</a> the 252 Venezuelan migrants deported to his country’s prisons by <a href=\"https://www.theguardian.com/us-news/donaldtrump\" data-link-name=\"in body link\">Donald Trump</a> for the same number of political prisoners in Venezuela.</p><p>Bukele made the offer on Sunday night in a message addressed directly to his authoritarian counterpart <a href=\"https://www.theguardian.com/world/nicolas-maduro\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Nicolás Maduro</a>. “I want to propose a humanitarian agreement that includes the repatriation of 100% of the 252 Venezuelans who were deported, in exchange for the release and delivery of an identical number … of the thousands of political prisoners that you hold,” El Salvador’s leader posted.</p><p>Hours later the proposal was rebuffed by one of Maduro’s top allies, the attorney general Tarek William Saab. In a televised address, Saab claimed the Salvadorian’s “cynical” offer exposed him as a narcissistic “neo-Nazi” who had “kidnapped” more than 250 Venezuelan migrants sent to a maximum-security jail in <a href=\"https://www.theguardian.com/world/el-salvador\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">El Salvador</a> by the Trump administration since mid-March.</p><p>“Bukele is a serial human rights violator,” Saab said, pointing to the politician’s “horrifying” three-year anti-gang crackdown, which has seen at least 85,000 Salvadorians <a href=\"https://www.theguardian.com/society/2022/jun/08/its-a-war-on-the-people-el-salvadora-mass-arrests-send-thousands-into-despair\" data-link-name=\"in body link\">thrown in jail, largely without due process</a>. Human rights activists say more than 360 prisoners have died.</p><p>Some members of Venezuela’s opposition – reeling from its failure to dislodge Maduro, despite seemingly beating him in last July’s presidential election – welcomed Bukele’s offer. Leopoldo López, an exiled opposition leader who lives in Spain, said the idea had his “full support”. The opposition’s most important leader, <a href=\"https://www.theguardian.com/world/article/2024/sep/06/venezuelas-opposition-leader-calls-for-global-movement-to-rescue-country\" data-link-name=\"in body link\">María Corina Machado</a>, made no immediate comment.</p><p>However, many political and human rights activists have voiced perplexity and shock that the Venezuelan migrants being held in El Salvador – having been denied due process in the US and deported to an authoritarian foreign land – had become embroiled in the political tussle between strongman populists such as Trump, Bukele and Maduro.</p><p>“The idea that there would be a [prisoner] trade should be loathsome to anyone who actually cares about human rights,” said Christopher Sabatini, a senior fellow for Latin America at Chatham House.</p><p>Geoff Ramsey, a Venezuela expert from the Atlantic Council’s Adrienne Arsht Latin America Center, suspected the plight of the Venezuelans being held in El Salvador and Bukele’s prisoner swap “PR stunt” had potential benefits for both Bukele and Maduro.</p><p>“Maduro’s quite happy to feud with Bukele and point to human rights abuses in El Salvador as a way of distracting from the brutal repression and violence of his own regime,” Ramsey said. According to the human rights group Foro Penal, Maduro’s jails currently house about 900 political prisoners. Thousands were imprisoned after last year’s election when Maduro, who has ruled since 2013, ordered a <a href=\"https://www.theguardian.com/global-development/article/2024/aug/08/venezuela-nicolas-maduro-contested-election-protests-detention\" data-link-name=\"in body link\">crackdown</a> to stop his apparent victor, Edmundo González, from taking power.</p><p>From Bukele’s perspective, offer was “a smart way of shifting the conversation away from concerns around the deportees being held in El Salvador back to the existence of political prisoners in Venezuela”, Ramsay said.</p><p>For the migrants caught up in the geopolitical jailings, the consequences are calamitous. Many have not been convicted of any crime and it is unclear how long they will be held.</p><p>In an interview last week, the wife of one Venezuelan prisoner, a singer called Arturo Suárez Trejo, lamented how the Venezuelan detainees seemed to have become part of a high-stakes game of chess. “And they are the pawns,” said Nathali Sánchez, rejecting claims that the father of her child was involved in crime. “It’s evil,” she added.</p><p>The Trump administration’s targeting of Venezuelan migrants – who it has accused, largely without evidence, of being gang members and terrorists – has put Venezuela’s opposition in a difficult spot.</p><p>Seemingly fearful of alienating Trump’s administration, its key leaders – including including Machado – have said little about the migration crackdown or the deportation of Venezuelan citizens to El Salvador. “[The opposition has] largely held its tongue on issues of the treatment of fellow citizens because of its larger goal of gaining the White House’s support for its preferred strategy [to defeat Maduro] and that also is reprehensible,” Sabatini said.</p><p>Among the friends and families of the incarcerated migrants – many of them opposition supporters who fled Venezuela to escape Maduro’s regime – the opposition’s failure to defend them is causing anger and frustration.</p><p>“The reality is that the Venezuelan opposition needs to have a good relationship with the White House, and they understand that they can’t be perceived as criticizing Trump,” said Ramsey. “But on the other hand, the general public in Venezuela is outraged at the situation faced by those who’ve been deported and sent to this maximum security jail in El Salvador. So it really puts the opposition in between a rock and a hard place.”</p>","contentLength":5134,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k4odvp/venezuela_accuses_el_salvador_of_human/"},{"title":"Algeria drops French, adopts English as university language","url":"https://www.universityworldnews.com/post.php?story=20250415221857998","date":1745259038,"author":"/u/After-Professional-8","guid":439,"unread":true,"content":"<img src=\"https://www.universityworldnews.com/mobile/bookmark_icon44.png\" alt=\"bookmark\" onclick=\"bookmark('20250415221857998','Algeria drops French, adopts English as university language');\">\nThe Algerian Ministry of Higher Education and Scientific Research has decided to replace French with English at universities, starting in September when the new academic year begins.<p>\nThe ministry’s move was outlined in a </p><a href=\"https://www.elkhabar.com/press/article/258991/%D8%AA%D8%B9%D9%85%D9%8A%D9%85-%D8%A7%D9%84%D8%AA%D8%AF%D8%B1%D9%8A%D8%B3-%D8%A8%D8%A7%D9%84%D9%84%D8%BA%D8%A9-%D8%A7%D9%84%D8%A7%D9%86%D8%AC%D9%84%D9%8A%D8%B2%D9%8A%D8%A9-%D8%A8%D8%AF%D8%A7%D9%8A%D8%A9-%D9%85%D9%86-%D8%A7%D9%84%D9%85%D9%88%D8%B3%D9%85-%D8%A7%D9%84%D8%AC%D8%A7%D9%85%D8%B9%D9%8A-%D8%A7%D9%84%D9%85%D9%82%D8%A8%D9%84/\" target=\"_new\">directive</a> at the beginning of April, instructing all public universities to begin transitioning first-year medical and scientific courses entirely to English, starting from the next academic year (September 2025).<p>\nThe move is part of a broader strategy to introduce English as the primary language of instruction across the country’s educational institutions – a shift framed as a step towards enhancing the internationalisation of the Algerian higher education sector, according to a 2025 </p><a href=\"https://www.researchgate.net/profile/Adel-Chiheb-3/publication/390434064_EMI_In_Algeria_Theorizing_As_A_Vehicle_For_The_Internationalization_Of_Local_Knowledge_In_The_Social_And_Human_Sciences/links/67edca4649e91c0fead83548/EMI-In-Algeria-Theorizing-As-A-Vehicle-For-The-Internationalization-Of-Local-Knowledge-In-The-Social-And-Human-Sciences.pdf\" target=\"_new\">study</a> titled, ‘EMI In Algeria: Theorizing as a vehicle for the internationalization Of local knowledge in the social and human sciences’.<p>\nIn the Maghreb, Algeria is North Africa’s third-highest user of French (33%), after Tunisia (52%) and Morocco (35%), according to a 2018 </p><a href=\"https://observatoire.francophonie.org/2018/synthese.pdf\" target=\"_new\">report</a> by the French Language Observatory.<b>What is driving the change?</b><p>\nAsked whether the Algerian move towards English is a political or educational move, Professor Bouraoui Seyfallah from the University of Sciences and Technology in Houari Boumediene, Algeria, told </p>: “Honestly, it’s hard to separate politics from education in a context like this, especially when the two countries share such a deep and complex history.<p>\n“In my opinion, this move is both political and educational, but the political dimension is likely to be the stronger driving force behind it right now,” said Seyfallah.</p><a href=\"https://www.middleeasteye.net/news/france-algeria-most-serious-diplomatic-crisis-end-colonial-rule\" target=\"_new\">Political tension</a> between France and Algeria, its former North African colony, emerged in July 2024. The trigger was France’s support for Morocco’s claims of sovereignty over Western Sahara – a resource-rich territory, considered by the United Nations as ‘non-autonomous’. It is controlled, for the most part, by Morocco but claimed by the Polisario Front, a Sahrawi independence movement supported by Algeria. The move infuriated Algiers, which announced the “withdrawal with immediate effect” of its ambassador to France.<b>A wider anti-France sentiment</b><p>\nBut Algeria is not the only country that has been undoing its relations with France.</p><p>\nOn 19 March Niger, Burkina Faso, and Mali decided to leave the international Organisation of La Francophonie (OIF), an organisation established by countries united by the French language, </p><a href=\"https://www.brasildefato.com.br/2025/03/25/mali-burkina-faso-and-niger-withdraw-from-international-organization-of-la-francophonie/\" target=\"_new\">alleging</a> that the OIF has become France’s “remote-controlled political instrument” operated from Paris to suit its “geopolitical considerations”.<p>\nAsked whether other African countries might follow Algeria in replacing the French language with English at its universities, Rosemary Salomone, a professor of law at the United States-based John’s University, said: “The situation in Niger, Burkina Faso, and Mali is somewhat unique in that these are all countries that have been taken over by military juntas who are now buttressed by Russian mercenaries.”</p><a href=\"https://global.oup.com/academic/product/the-rise-of-english-9780190625610?cc=us&amp;lang=en&amp;#\" target=\"_new\">book</a>, <i>The Rise of English: Global politics and the power of language</i>, added: “They not only have left the OIF, they have all demoted French from an official to a working language, demanded that all French troops leave their respective countries, and begun dismantling traces of colonialism, including street names and monuments.<p>\n“These countries are now thrown into chaos so the possibility of their resetting language policy in higher education is highly unlikely. That said, France is clearly losing its foothold in its former French colonies in Africa,” Salomone pointed out.</p><p>\nAccording to her, Senegal and Côte d’Ivoire have also terminated France’s military presence amid popular cries for sovereignty and decolonisation. This could lead to their eventually moving toward English in their universities for both anti-French and pragmatic reasons.</p><b>French a ‘lost language’?</b><p>\nAlgerian Professor Sadallah Boubaker-Khaled from the </p> in Algiers, Algeria, told : “French has become a lost language” that is not used in many French educational institutions in former colonies where French was the first language, including in universities.<p>\n“How can we use French in our universities at this time when even its speakers have become alienated from it?”</p><p>\nHe said young people had come to prefer studying in English because it “solves their educational and employment problems” to a greater extent than does French.</p><p>\n“English is now the dominant language in science, technology, economics and diplomacy. By integrating English into universities, Algeria is likely seeking to further open its students to the world and promote their competitiveness in the international job market and academic research,” Seyfallah said.</p><p>\nEchoing Seyfallah’s view, Salomone said changing to an English-based higher educational system would ease the way for Algeria to create the human capital for attracting multinational corporations, prepare students for the global economy where English is the dominant </p>, put Algeria in tune with technological advances internationally, and give the work of researchers greater visibility.<b>A gradual approach needed</b><p>\nBut Seyfallah pointed out that, while English was gaining ground among the youth, especially online, the overall level of English proficiency among university students and professors was not high enough to switch entirely from French to English – especially in technical and scientific fields where precise terminology was key.</p><a href=\"https://www.ef.com/wwen/epi/\" target=\"_new\">Education First English Proficiency Index</a>, Algeria is ranked 78 out of 116 countries worldwide and is classified as having “low English proficiency”.<p>\n“The main challenges Algerian universities will face are low English proficiency, the lack of English educational resources, teacher resistance or unpreparedness and inequalities between institutions and cultural and identity resistance,” Seyfallah said.</p><p>\n“Honestly, there’s a lot that Algerian universities need to do to successfully prepare for such a major transition. If I had to sum it up, I’d say they need to take a gradual, well-supported and inclusive approach,” Seyfallah suggested.</p><p>\nSalomone added that, while the Algerian government had now mandated English language classes beginning in the primary grades, the question remains as to whether students entering university have gained the necessary skills in academic English.</p><p>\n“Just as concerning is whether Algeria has a sufficient number of faculty members prepared to teach in English. Building that level of linguistic infrastructure takes years of intensive language training.</p><p>\n“One way to address the problem is to test all students entering the university and provide intense English language classes (perhaps over the summer and continuing into the academic year) for those who do not meet a threshold of competence across language skills, including reading, writing and listening comprehension.”</p><p>\nAccording to Salomone, the same could be done for faculty members and administrators.</p><p>\n“Universities might also consider, at least initially, hiring visiting faculty from anglophone countries or initiating faculty exchange programmes with anglophone countries,” she said.\n</p>","contentLength":7198,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k4kapl/algeria_drops_french_adopts_english_as_university/"},{"title":"Scientists unveil ‘olo’: A colour never before seen by the human eye","url":"https://www.ctvnews.ca/sci-tech/article/scientists-unveil-olo-a-colour-never-before-seen-by-the-human-eye/","date":1745240889,"author":"/u/CTVNEWS","guid":437,"unread":true,"content":"<p>Published:&nbsp;<time datetime=\"2025-04-21T10:00:00Z\">April 21, 2025 at 6:00AM EDT</time></p>","contentLength":40,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k4d3aw/scientists_unveil_olo_a_colour_never_before_seen/"},{"title":"Kremlin satisfied with US statements that Ukraine will not join NATO","url":"https://www.pravda.com.ua/eng/news/2025/04/21/7508502/","date":1745238311,"author":"/u/Creol6969","guid":442,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k4c882/kremlin_satisfied_with_us_statements_that_ukraine/"},{"title":"China sends back new Boeing jet made more expensive by tariffs","url":"https://www.theguardian.com/us-news/2025/apr/21/china-returns-boeing-737-jet-us-too-expensive-tariffs","date":1745235942,"author":"/u/ThisSideOfThePond","guid":438,"unread":true,"content":"<p>A <a href=\"https://www.theguardian.com/business/boeing\" data-link-name=\"in body link\" data-component=\"auto-linked-tag\">Boeing</a> jet intended for a Chinese airline landed back at the planemaker’s US production hub on Sunday, a victim of the tit-for-tat bilateral tariffs launched by Donald Trump.</p><p>The 737 MAX, which was meant for China’s Xiamen Airlines, landed at Seattle’s Boeing Field at 6.11pm, according to a Reuters witness. It was painted with Xiamen livery.</p><p>The jet, which made refuelling stops in Guam and Hawaii on its 5,000-mile (8,000-km) return journey, was one of several 737 MAX jets – Boeing’s bestselling model – that had been waiting at Boeing’s Zhoushan completion centre for final work and delivery.</p><p>Trump this month raised baseline tariffs on Chinese imports to 145%. In retaliation, China imposed a 125% tariff on US goods.</p><p>A Chinese airline taking delivery of a Boeing jet could be crippled by the tariffs, given that a new 737 MAX has a market value of around $55m, according to IBA, an aviation consultancy. Beijing is reportedly considering ways to support airlines that lease Boeing jets and are facing higher costs.</p><p>Last week it was reported that China’s government had <a href=\"https://www.theguardian.com/business/2025/apr/15/china-orders-airlines-to-halt-boeing-jet-deliveries-us-tariffs\" data-link-name=\"in body link\">asked Chinese airlines to pause purchases</a> of aircraft-related equipment and parts from American companies like Boeing. China holds about 20% of the expected global demand for aircraft over the next two decades.</p><p>Boeing’s order book had 130 planes scheduled for deliver to Chinese companies at the end of March for both commercial airlines and leasing firms, Airways Mag <a href=\"https://www.airwaysmag.com/new-post/boeing-take-back-737-max-jets-china\" data-link-name=\"in body link\">reported</a>.</p><p>It was not clear which party made the decision for the aircraft to return to the US. Boeing and Xiamen had not responded to Reuters requests for comment at time of publication.</p><p>Just hours before Trump detailed his so-called “liberation day” tariffs, Boeing chief executive, <a href=\"https://fortune.com/2024/07/31/boeing-kelly-ortberg-background-age-salary/\" data-link-name=\"in body link\">Kelly Ortberg</a>, told a US Senate hearing that the company sold about 80% of its planes overseas and wanted to avoid getting into a situation where “certain markets become closed to us”.</p><p>Ortberg said there was about half a trillion dollars in backlogged orders at the time.</p><p>Michael O’Leary, the group chief executive of budget airline Ryanair, told the Financial Times last week that the company was due to receive 25 Boeing aircraft from August but “we might delay them and hope that common sense will prevail”.</p>","contentLength":2263,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k4bhu5/china_sends_back_new_boeing_jet_made_more/"},{"title":"China to sanction US Congress members and others who ‘acted egregiously’ on Hong Kong","url":"https://www.scmp.com/news/china/diplomacy/article/3307291/china-sanctions-us-congress-members-officials-and-others-who-behaved-badly-hong-kong?module=top_story&amp;pgtype=homepage","date":1745235939,"author":"/u/Saltedline","guid":440,"unread":true,"content":"<div datatype=\"p\" data-qa=\"Component-Component\">China will apply tit-for-tat sanctions on US Congress members, officials and heads of non-governmental organisations that Beijing deems to have “acted egregiously” on <a target=\"_self\" href=\"https://www.scmp.com/news/hong-kong?module=inline&amp;pgtype=article\" data-qa=\"BaseLink-renderAnchor-StyledAnchor\"></a>-related issues.</div><p datatype=\"p\" data-qa=\"Component-Component\">Foreign ministry spokesman Guo Jiakun described the US sanctions as a “severe interference in Hong Kong affairs, which are China’s internal affairs”. They were also a “grave violation of the principles of international law and the basic norms of international relations”, he said.</p><div data-qa=\"Component-renderMap-StyledDiv\"><div data-qa=\"Component-SCMPYoutubeVideoContainer\"><div data-qa=\"SCMPYoutubeVideoPreview-PreviewContainer\"><img data-qa=\"BaseImage-handleRenderImage-StyledImage\" loading=\"lazy\" src=\"https://cdn.i-scmp.com/sites/default/files/styles/wide_landscape/public/d8/video/thumbnail/2025/03/04/CLEAN---thumbnail_3.jpg?itok=kwKs6zJY\"><div data-qa=\"SCMPYoutubeVideoPreview-PreviewContentContainer\"><div data-qa=\"SCMPYoutubeVideoPreview-PreviewContentFloatContainer\"><div data-qa=\"SCMPYoutubeVideoPreview-PreviewContentDataContainer\"><p data-qa=\"SCMPYoutubeVideoPreview-PreviewTitle\">China hits back at Trump with reciprocal tariffs, sanctions on US firms</p></div></div></div></div><div data-qa=\"SCMPYouTubeVideoFooter-VideoTitleContainer\"><div data-qa=\"SCMPYouTubeVideoFooter-VideoTitle\">China hits back at Trump with reciprocal tariffs, sanctions on US firms</div></div></div></div><p datatype=\"p\" data-qa=\"Component-Component\">China “strongly condemns” the US decision and would sanction “Congress members, officials and heads of NGOs who acted egregiously on Hong Kong issues”, Guo said, without offering further details.</p><p datatype=\"p\" data-qa=\"Component-Component\">In a brief statement on Monday, a Hong Kong government spokesman said: “The [Hong Kong government] firmly rejects and despises the so-called US sanction against officers who safeguard our national security.</p><p datatype=\"p\" data-qa=\"Component-Component\">“We fully support the central government’s counter action against the US.”</p><p datatype=\"p\" data-qa=\"Component-Component\">Washington announced sanctions on national security and other high-ranking officials on March 31, saying those people were believed to have used the city’s national security laws “extraterritorially to intimidate, silence and harass 19 pro-democracy activists”.</p><p datatype=\"p\" data-qa=\"Component-Component\">The decision comes amid a tariff war between the two countries. Washington has imposed tariffs totalling 145 per cent on Chinese imports so far this year, bringing the effective tariff rate to about 156 per cent.</p>","contentLength":1589,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k4bhss/china_to_sanction_us_congress_members_and_others/"},{"title":"Pope Francis has died, the Vatican camerlengo, announces","url":"https://apnews.com/article/vatican-pope-francis-dead-01ca7d73c3c48d25fd1504ba076e2e2a","date":1745222411,"author":"/u/MrNewVegas2077","guid":444,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k484c0/pope_francis_has_died_the_vatican_camerlengo/"},{"title":"'No NATO, US recognizing annexation of Crimea' — Washington awaits Kyiv's response to ceasefire pitch, WSJ reports","url":"https://kyivindependent.com/kyiv-faces-pressure-to-respond-to-us-proposals-on-ending-war-with-russia-wsj-reported/","date":1745220999,"author":"/u/EsperaDeus","guid":436,"unread":true,"content":"<p>Ukraine is under pressure to respond this week to a U.S. proposal on concluding the war with Russia, which includes the possibility of Washington recognizing Moscow’s 2014 annexation of Crimea and barring Ukraine from NATO, the Wall Street Journal reported on April 20, citing an obtained document.</p><p>The <a href=\"https://www.wsj.com/world/europe/kyiv-is-on-the-clock-to-respond-to-trump-plan-to-end-ukraine-conflict-f3538799?mod=hp_lead_pos1\">proposals</a>, outlined by senior Trump administration officials in a confidential meeting with Ukrainian and European counterparts in <a href=\"https://kyivindependent.com/paris-talks-on-ukraine-signal-european-role-in-ceasefire-negotiations-french-fm-says/\">Paris</a> on April 17, were confirmed by Western officials to the WSJ. </p><p>The news comes as Washington signaled <a href=\"https://kyivindependent.com/us-ready-to-abandon-russia-ukraine-ceasefire-efforts-rubio-says/\">readiness</a> to drop ceasefire efforts within the coming days unless progress is achieved. </p><p>Ukraine's feedback is expected at a follow-up meeting in London later this week. If there is alignment between Kyiv, Washington, and European allies, the proposals could be formally introduced to Moscow.</p><p>Among the most controversial elements is the suggestion that the <a href=\"https://kyivindependent.com/tag/united-states/\">U.S.</a> could formally recognize Russia’s illegal annexation of <a href=\"https://kyivindependent.com/tag/crimea/\">Crimea</a>. Additionally, Ukrainian accession to NATO would be ruled out under the current proposal. </p><p>\"NATO isn’t on the table,\" said U.S. Special Envoy to Ukraine <a href=\"https://kyivindependent.com/tag/keith-kellogg/\">Keith Kellogg</a> in an interview with Fox News on April 20.</p><p>Ukraine has previously said it <a href=\"https://kyivindependent.com/ukraine-wont-recognize/\">would not recognize </a>occupied territories as Russian as part of any peace deal. The move to recognize Crimea under Russian rule also contradicts a decade-long bipartisan consensus in Washington and international law.</p><p>In 2018, then-Secretary of State Mike Pompeo reaffirmed U.S. opposition to the annexation, calling it a threat to \"a bedrock international principle shared by democratic states: that no country can change the borders of another by force.\" The U.S. Congress has also passed legislation opposing any recognition of Russia’s claim over Crimea.</p><p>Ukraine has also previously <a href=\"https://kyivindependent.com/sybiha-on-negotiations/\">rejected</a> restrictions on joining international alliances and organizations—namely, NATO and the EU—as part of a potential peace deal. NATO Secretary-General Mark Rutte recently said that Kyiv's path toward membership remains \"irreversible\" but added that the matter would not be part of an eventual peace settlement.</p><p>The Ukrainian delegation in Paris included Andriy Yermak, chief of staff to President Volodymyr Zelensky, along with Foreign Minister Andrii Sybiha and Defense Minister Rustem Umerov. According to the WSJ, the Trump team, including Kellogg and special envoy Steve Witkoff, should be present at the London meeting as well.</p><p>Witkoff is then expected to travel to Moscow, the WSJ reported. Officially the special envoy for the Middle East, Witkoff has led Trump's diplomatic outreach to Russia, meeting Russian President Vladimir Putin three times, most <a href=\"https://kyivindependent.com/putin-witkoff-discuss-aspects-of-ukrainian-settlement-kremlin-says/\">recently on April 11</a>.</p><p>In a comment to the WSJ, a senior State Department official emphasized that the ideas were presented as \"potential options\" rather than ultimatums, though Kyiv is expected to offer a firm stance quickly.</p><p>Another proposal would involve establishing a neutral zone around the Russian-occupied <a href=\"https://kyivindependent.com/tag/zaporizhzhia-nuclear-power-plant/\">Zaporizhzhia Nuclear Power Plant</a>, the largest nuclear power station in Europe, potentially leaving it under American control.</p><p>In an earlier <a href=\"https://docs.google.com/document/d/1S5u7YYEoHFmDZjedKQ0eoG0mDFDYD0otSfqCo5W8xqg/edit?tab=t.0\">call</a> with Zelensky, U.S. President Donald Trump reportedly suggested the idea of the U.S. acquiring Ukrainian energy assets, which he said could be the \"best protection for that infrastructure.\"</p><p>While the U.S. proposals stop short of granting Russia formal legal recognition of its claimed annexation of four partially occupied eastern Ukrainian regions, they also do not call for the withdrawal of Russian troops from those areas. </p><p>\nSince 2022, Moscow has illegally declared Ukraine's Donetsk, Luhansk, Zaporizhzhia, and Kherson oblasts as part of the Russian Federation, incorporating them into its Constitution and demanding the complete retreat of Ukrainian forces from their administrative borders.</p><p>The Trump administration has not ruled out bilateral military assistance to Ukraine or support for European nations contributing forces to a \"reassurance force,\" a potential buffer against future aggression. However, no specific security guarantees have yet been offered as part of the proposed deal.</p><p>This goes in contrast with Russian demands for a full halt of military support to Ukraine, which the Kremlin voiced as a precondition to a 30-day <a href=\"https://kyivindependent.com/tag/ceasefire/\">ceasefire</a> suggested by the Trump administration over a month ago. While <a href=\"https://kyivindependent.com/tag/ukraine/\">Ukraine</a> has accepted the offer if <a href=\"https://kyivindependent.com/tag/russia/\">Russia</a> reciprocates, Moscow has not yet supported the idea. In recent weeks, Russia has intensified attacks on civilians in Ukrainian cities.</p><p>During talks with the U.S. representatives in Saudi Arabia, Kremlin officials were reportedly seeking relief from U.S. sanctions and the restoration of trade ties, efforts being led by Putin’s envoy <a href=\"https://kyivindependent.com/tag/kirill-dmitriev/\">Kirill Dmitriev</a>.</p><p>Zelensky’s office has not publicly commented on the details of the U.S. proposal. On April 19, Ukrainian officials reaffirmed openness to a mutual 30-day ceasefire, though they accused Moscow of violating a temporary truce over the Easter holiday on April 20.</p>","contentLength":4983,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/worldnews/comments/1k47sx5/no_nato_us_recognizing_annexation_of_crimea/"}],"tags":["news","reddit"]}