{"id":"7DceLgR4szFyHjpUotrBgPp9fEDdwmRmyXGW53xLQnbPAifjKVFPj1dyKJ6sHa1bC6AC9QFBhYUJLmJ6GyX57","title":"top scoring links : linux","displayTitle":"Reddit - Linux","url":"https://www.reddit.com/r/linux/top/.rss?sort=top&t=day&limit=6","feedLink":"https://www.reddit.com/r/linux/top/?sort=top&t=day&limit=6","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":6,"items":[{"title":"I was bored, so I created a Reddit CLI client (read-only). You cannot upvote or comment, but it’s better than nothing—for sure, it’s my go-to choice for a quick peek at my favorite subreddit to check what’s new or news about tariffs, haha.","url":"https://www.reddit.com/r/linux/comments/1k4yjf3/i_was_bored_so_i_created_a_reddit_cli_client/","date":1745298915,"author":"/u/internal-pagal","guid":414,"unread":true,"content":"   submitted by   <a href=\"https://www.reddit.com/user/internal-pagal\"> /u/internal-pagal </a>","contentLength":37,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Steam Linux Support - Valve will abandon support of the Steam client on Linux distributions without glibc 2.31 or newer as of 8/15/25","url":"https://help.steampowered.com/en/faqs/view/107F-BB20-FB5A-1CE4","date":1745295908,"author":"/u/wickedplayer494","guid":415,"unread":true,"content":"<!DOCTYPE html>","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1k4xq6p/steam_linux_support_valve_will_abandon_support_of/"},{"title":"SouthEast LinuxFest 2025 Registration and CFP is open","url":"https://southeastlinuxfest.org/2025/04/self-2025-update/","date":1745273938,"author":"/u/q5sys","guid":412,"unread":true,"content":"<p>This year’s theme: Retro computing.Registration is NOW OPEN.<a href=\"https://speakers.southeastlinuxfest.org\">Call for speakers </a>closes very soon on 4/27!Do you have some cool retro computing stuff you’d like to bring to show or swap? We’ll be having a <a href=\"https://github.com/q5sys/2025-Southeast-Linuxfest-Swapfest\" data-type=\"link\" data-id=\"https://github.com/q5sys/2025-Southeast-Linuxfest-Swapfest\">Swapfest</a> at SELF.We are looking for <a href=\"https://southeastlinuxfest.org/self-2025/self-2025/sponsor/\" data-type=\"page\" data-id=\"21\">sponsors</a> for this year’s event.Get ahead of the rush and <a href=\"https://exams.southeastlinuxfest.org/\">register for the ham radio exam</a> (FREE).We are also looking for <a href=\"https://southeastlinuxfest.org/self-2025/self-2025/volunteer/\" data-type=\"page\" data-id=\"59\">volunteers</a> for this year’s event. Volunteers are eligible for the volunteer raffle, which features everything from servers and networking equipment to books about open source autographed by the author.</p>","contentLength":569,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1k4qdsb/southeast_linuxfest_2025_registration_and_cfp_is/"},{"title":"\"Welp\" -- Wrangle, Enumerate, Label, Place.","url":"https://www.reddit.com/r/linux/comments/1k4j2hj/welp_wrangle_enumerate_label_place/","date":1745256184,"author":"/u/Beautiful_Crab6670","guid":413,"unread":true,"content":"<p>(Massively) rename files on a given directory (or current), with an option to tag files based on their extension or send the renamed files to another directory. Free, portable, minimal, efficient.</p><p><a href=\"https://gitlab.com/gee.8ruhs/writteninc/-/blob/main/welp.c\">Click here</a> to grab the C code and for instructions on how to compile it.</p>","contentLength":268,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":null},{"title":"Android 16 lets the Linux Terminal use your phone's entire storage -- \"With the latest Android 16 beta, you can now allocate as much storage as you want to the Linux Terminal\"","url":"https://www.androidauthority.com/android-16-terminal-disk-resize-3546144/","date":1745228229,"author":"/u/throwaway16830261","guid":416,"unread":true,"content":"<div data-container-type=\"content\"><ul><li>Pixel phones now feature a Linux Terminal app, enabling users to run a Debian virtual machine for desktop apps alongside Android ones.</li><li>While still lacking features like GUI/audio, the recent Android 16 Beta 4 release removes the previous 16GB storage cap for the Linux VM.</li><li>Google plans to eventually replace manual storage resizing with dynamic ballooning, allowing the VM storage to adjust automatically based on need.</li></ul></div><div>Pixel phones are taking a step towards becoming powerful portable PCs with the introduction of the <a href=\"https://www.androidauthority.com/android-linux-terminal-app-available-3532999/\">Linux Terminal app</a> in the March 2025 update. This app lets compatible Android devices run a full-fledged instance of the popular Debian distro in a virtual machine, opening the door to running popular Linux desktop programs alongside Android apps. However, the feature isn’t quite ready for everyday professional use, currently lacking support for critical features like graphical apps and audio output, and until recently, it was restricted to just 16GB of storage space, limiting the Linux VM’s capacity for apps and files. Thankfully, Google just lifted that storage limitation, allowing the Linux Terminal to use as much of your phone’s storage as needed.</div><div data-container-type=\"content\"><div><p>\nYou’re reading an  story. Discover <a href=\"https://www.androidauthority.com/tag/authority-insights/\">Authority Insights</a> for more exclusive reports, app teardowns, leaks, and in-depth tech coverage you won’t find anywhere else.</p></div></div><div><p>With the release of the fourth <a href=\"https://www.androidauthority.com/android-16-features-3484159/\">Android 16</a> beta, Google has uncapped the disk resize slider in the Linux Terminal app’s settings. In previous releases, the disk size was capped at 16GB. In <a href=\"https://www.androidauthority.com/android-16-beta-4-3545798/\">Android 16 Beta 4</a>, however, the disk can be resized to occupy most of the host device’s remaining storage, leaving 1GB free to prevent the virtual machine from consuming all available space.</p></div><div><p>I tested this feature on a <a href=\"https://www.androidauthority.com/google-pixel-9-3365966/\">Google Pixel 9 Pro</a> running Android 16 Beta 4, successfully resizing the Linux disk to 42.3GB. The process took only a few seconds, and after restarting the VM, the increased storage was immediately available. According to Android’s storage settings, the total size consumed by the Linux Terminal app (including the base app and the resized VM disk) grew to approximately 45.52GB.</p></div><div><p>In a future release, Google plans to remove the disk resize slider entirely from the Linux Terminal app. Instead, the app will employ storage ballooning to dynamically adjust the storage space available to the Debian VM. This feature allows the guest VM’s storage to “inflate” to use available space and “deflate” when the host system needs to reclaim it. This approach offers two key benefits: the storage allocated to Debian doesn’t need to be fixed upfront, and it protects the host from running out of space by automatically shrinking the guest’s available storage when necessary.</p></div><div><p>Google is rapidly improving the Linux Terminal app, recognizing its key role in the company’s plans to <a href=\"https://www.androidauthority.com/chrome-os-becoming-android-3500661/\">transition Chrome OS to an Android base</a>. Although the app theoretically allows for running full-fledged Linux desktop environments, Google says the <a href=\"https://www.androidauthority.com/android-linux-terminal-purpose-3535765/\">Terminal’s primary purpose</a> is to enable running Linux apps alongside Android apps, not to replace Android’s native desktop mode. Still, Google’s efforts will unlock some exciting use cases, and it’ll be fascinating to see the innovative ways that users leverage the Linux Terminal on their Pixels as the app matures.</p></div><div data-container-type=\"content\"> Email our staff at <a href=\"mailto:news@androidauthority.com\" rel=\"noopener noreferrer\" data-stringify-link=\"mailto:tips@androidauthority.com\" data-sk=\"tooltip_parent\" aria-haspopup=\"menu\">news@androidauthority.com</a>. You can stay anonymous or get credit for the info, it's your choice.</div>","contentLength":3426,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1k49hu8/android_16_lets_the_linux_terminal_use_your/"},{"title":"stal/IX - statically linked, source based, bootstrapped rolling Linux, based on IX package manager","url":"https://stal-ix.github.io/","date":1745224681,"author":"/u/JazzedPineda","guid":411,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://www.reddit.com/r/linux/comments/1k48nnx/stalix_statically_linked_source_based/"}],"tags":["dev","reddit"]}