{"id":"VMK7D8tQvwsLtnxKHzNdF9c4Yhtuqm","title":"Hacker News: Best","displayTitle":"HN","url":"https://hnrss.org/best","feedLink":"https://news.ycombinator.com/best","isQuery":false,"isEmpty":false,"isHidden":false,"itemCount":30,"items":[{"title":"Getting forked by Microsoft","url":"https://philiplaine.com/posts/getting-forked-by-microsoft/","date":1745233544,"author":"phillebaba","guid":201,"unread":true,"content":"<p>Three years ago, I was part of a team responsible for developing and maintaining Kubernetes clusters for end user customers. A main source for downtime in customer environments occurred when image registries went down. The traditional way to solve this problem is to set up a stateful mirror, however we had to work within customer budget and time constraints which did not allow it. During a Black Friday, we started getting hit with a ton of traffic while GitHub container registries were down. This limited our ability to scale up the cluster as we depended on critical images from that registry. After this incident, I started thinking about a better way to avoid these scalability issues. A solution that did not need a stateful component and required minimal operational oversight. This is where the idea for <a href=\"https://github.com/spegel-org/spegel\">Spegel</a> came from.</p><p>As a sole maintainer of an open source project, I was enthused when Microsoft reached out to set up a meeting to talk about Spegel. The meeting went well, and I felt there was going to be a path forward ripe with cooperation and hopefully a place where I could onboard new maintainers. I continued discussions with one of the Microsoft engineers, helping them get Spegel running and answering any architecture questions they had. At the time I was positive as I saw it as a possibility for Micorosft to contribute back changes based on their learnings. As time went on, silence ensued, and I assumed work priorities had changed.</p><p>It was not until KubeCon Paris where I attended a talk that piqued my interest. The talk was about strategies to speed up image distribution where one strategy discussed was P2P sharing. The topics in the abstract sounded similar to Spegel so I was excited to hear other’s ideas about the problem. During the talk, I was enthralled seeing Spegel, my own project, be discussed as a P2P image sharing solution. When <a href=\"https://github.com/Azure/peerd\">Peerd</a>, a peer to peer distributor of container content in Kubernetes clusters made by Microsoft, was mentioned I quickly researched it. At the bottom of the README there was a thank you to myself and Spegel. This acknowledgement made it look like they had taken some inspiration from my project and gone ahead and developed a version of their own.</p><p>While looking into Peerd, my enthusiasm for understanding different approaches in this problem space quickly diminished. I saw function signatures and comments that looked very familiar, as if I had written them myself. Digging deeper I found test cases referencing Spegel and my previous employer, test cases that have been taken directly from my project. References that are still present to this day. The project is a forked version of Spegel, maintained by Microsoft, but under Microsoft’s MIT license.</p><p>Spegel was published with an MIT license. Software released under an MIT license allows for forking and modifications, without any requirement to contribute these changes back. I default to using the MIT license as it is simple and permissive. The license does not allow removing the original license and purport that the code was created by someone else. It looks as if large parts of the project were copied directly from Spegel without any mention of the original source. I have included a short snippet comparing the code which adds the mirror configuration where even the function comments are the same.</p><p>A negative impact from the creation of Peerd is that it has created confusion among new users. I am frequently asked about the differences between Spegel and Peerd. As a maintainer, it is my duty to come across as unbiased and factual as possible, but this tumultuous history makes it challenging. Microsoft carries a large brand recognition, so it has been difficult for Spegel to try and take up space next to such a behemoth.</p><p>As an open source maintainer I have dedicated ample time to community requests, bug fixes, and security fixes. In my conversation with Microsoft I was open to collaboration to continue building out a tool to benefit the open source community. Over the years I have contributed to a multitude of open source projects and created a few of my own. Spegel was the first project I created from the ground up that got some traction and seemed to be appreciated by the community. Seeing my project being forked by Microsoft made me feel like I was no longer useful. For a while I questioned if it was even worth continuing working on Spegel.</p><p>Luckily, I persisted. Spegel still continues strong with over 1.7k stars and 14.4 million pulls since its first release over two years ago. However, I am not the first and unfortunately not the last person to come across this David versus Goliath-esque experience. How can sole maintainers work with multi-billion corporations without being taken advantage of? With the changes of Hashicorp licensing having a rippling effect through the open source community, along with the strong decline in investment in open source as a whole, how does the community prevail? As an effort to fund the work on Spegel I have enabled GitHub sponsors. This experience has also made me consider changing the license of Spegel, as it seems to be the only stone I can throw.</p>","contentLength":5156,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43750535"},{"title":"Pope Francis has died","url":"https://www.reuters.com/world/pope-francis-has-died-vatican-says-video-statement-2025-04-21/","date":1745222414,"author":"phillipharris","guid":240,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43749405"},{"title":"Python’s new t-strings","url":"https://davepeck.org/2025/04/11/pythons-new-t-strings/","date":1745209895,"author":"tambourine_man","guid":239,"unread":true,"content":"<p>Template strings, also known as t-strings, have been <a href=\"https://peps.python.org/pep-0750/\">officially accepted</a> as a feature in Python 3.14, which will ship in late 2025. 🎉</p><p>I’m excited; t-strings open the door to safer more flexible string processing in Python.</p><h4>What’s the big idea with t-strings?</h4><p>Since they were introduced in Python 3.6, <a href=\"https://docs.python.org/3/tutorial/inputoutput.html#formatted-string-literals\">f-strings</a> have become a  popular way to format strings. They are concise, readable, and powerful.</p><p>In fact, they’re  delightful that many developers use f-strings for everything… even when they shouldn’t!</p><p>Alas, f-strings are often dangerously (mis)used to format strings that contain user input. I’ve seen f-strings used for SQL (<code>f\"SELECT * FROM users WHERE name = '{user_name}'\"</code>) and for HTML (<code>f\"&lt;div&gt;{user_name}&lt;/div&gt;\"</code>). These are not safe! If  contains a malicious value, it can lead to <a href=\"https://owasp.org/www-community/attacks/SQL_Injection\">SQL injection</a> or <a href=\"https://owasp.org/www-community/attacks/xss/\">cross-site scripting</a>.</p><p>Template strings are a  of Python’s f-strings. Whereas f-strings immediately become a string, t-strings evaluate to a new type, <code>string.templatelib.Template</code>:</p><pre tabindex=\"0\" data-language=\"python\"><code></code></pre><p>Importantly,  instances are  strings. The  type does not provide its own  implementation, which is to say that calling  does not return a useful value. Templates  be processed before they can be used; that processing code can be written by the developer or provided by a library and can safely escape the dynamic content.</p><p>We can imagine a library that provides an  function that takes a  and returns a safely escaped string:</p><pre tabindex=\"0\" data-language=\"python\"><code></code></pre><p>Of course, t-strings are useful for more than just safety; they also allow for more flexible string processing. For example, that  function could return a new type, . It could also accept all sorts of useful substitutions in the HTML itself:</p><pre tabindex=\"0\" data-language=\"python\"><code></code></pre><p>If you’ve worked with JavaScript, t-strings may feel familiar. They are the pythonic parallel to JavaScript’s <a href=\"https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Template_literals#tagged_templates\">tagged templates</a>.</p><h4>How do I work with t-strings?</h4><p>To support processing, s give developers access to the string and its interpolated values  they are combined into a final string.</p><p>The  and  properties of a  return tuples:</p><pre tabindex=\"0\" data-language=\"python\"><code></code></pre><p>There is always one more (possibly empty) string than value. That is,  and <code>t\"{name}\".strings == (\"\", \"\")</code>.</p><p>As a shortcut, it’s also possible to iterate over a :</p><pre tabindex=\"0\" data-language=\"python\"><code></code></pre><p>Developers writing complex processing code can also access the gory details of each interpolation:</p><pre tabindex=\"0\" data-language=\"python\"><code></code></pre><p>In addition to supporting the literal () form, s can also be instantiated directly:</p><pre tabindex=\"0\" data-language=\"python\"><code></code></pre><p>Strings and interpolations can be provided to the  constructor in any order.</p><h4>A simple t-string example</h4><p>Let’s say we wanted to write code to convert all substituted words into pig latin. All it takes is a simple function:</p><pre tabindex=\"0\" data-language=\"python\"><code></code></pre><h4>What’s next once t-strings ship?</h4><p>T-strings are a powerful new feature that will make Python string processing safer and more flexible. I hope to see them used in all sorts of libraries and frameworks, especially those that deal with user input.</p><p>In addition, I hope that the tooling ecosystem will adapt to support t-strings. For instance, I’d love to see  and  format t-string , and  those contents, if they’re a common type like HTML or SQL.</p>","contentLength":2997,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43748512"},{"title":"Gemma 3 QAT Models: Bringing AI to Consumer GPUs","url":"https://developers.googleblog.com/en/gemma-3-quantized-aware-trained-state-of-the-art-ai-to-consumer-gpus/","date":1745151726,"author":"emrah","guid":238,"unread":true,"content":"<img src=\"https://storage.googleapis.com/gweb-developer-goog-blog-assets/images/Gemma3QuantizedWagtail_RD1_01b.original.png\" alt=\"Gemma 3 Quantization Aware - banner\"><div><p data-block-key=\"sisye\">Last month, we launched Gemma 3, our latest generation of open models. Delivering state-of-the-art performance, Gemma 3 quickly established itself as a leading model capable of running on a single high-end GPU like the NVIDIA H100 using its native BFloat16 (BF16) precision.</p><p data-block-key=\"4impe\">To make Gemma 3 even more accessible, we are announcing new versions optimized with Quantization-Aware Training (QAT) that dramatically reduces memory requirements while maintaining high quality. This enables you to run powerful models like Gemma 3 27B locally on consumer-grade GPUs like the NVIDIA RTX 3090.</p></div><div><h2 data-block-key=\"sisye\">Understanding performance, precision, and quantization</h2><p data-block-key=\"2a2jr\">The chart above shows the performance (Elo score) of recently released large language models. Higher bars mean better performance in comparisons as rated by humans viewing side-by-side responses from two anonymous models. Below each bar, we indicate the estimated number of NVIDIA H100 GPUs needed to run that model using the BF16 data type.</p><p data-block-key=\"ae0co\"><b>Why BFloat16 for this comparison?</b> BF16 is a common numerical format used during inference of many large models. It means that the model parameters are represented with 16 bits of precision. Using BF16 for all models helps us to make an apples-to-apples comparison of models in a common inference setup. This allows us to compare the inherent capabilities of the models themselves, removing variables like different hardware or optimization techniques like quantization, which we'll discuss next.</p><p data-block-key=\"3q45i\">It's important to note that while this chart uses BF16 for a fair comparison, deploying the very largest models often involves using lower-precision formats like FP8 as a practical necessity to reduce immense hardware requirements (like the number of GPUs), potentially accepting a performance trade-off for feasibility.</p><h2 data-block-key=\"8r8jc\">The Need for Accessibility</h2><p data-block-key=\"dkjr0\">While top performance on high-end hardware is great for cloud deployments and research, we heard you loud and clear: you want the power of Gemma 3 on the hardware you already own. We're committed to making powerful AI accessible, and that means enabling efficient performance on the consumer-grade GPUs found in desktops, laptops, and even phones.</p><h2 data-block-key=\"950c\">Performance Meets Accessibility with Quantization-Aware Training in Gemma 3</h2><p data-block-key=\"158md\">This is where quantization comes in. In AI models, quantization reduces the precision of the numbers (the model's parameters) it stores and uses to calculate responses. Think of quantization like compressing an image by reducing the number of colors it uses. Instead of using 16 bits per number (BFloat16), we can use fewer bits, like 8 (int8) or even 4 (int4).</p><p data-block-key=\"3a7o0\">Using int4 means each number is represented using only 4 bits – a 4x reduction in data size compared to BF16. Quantization can often lead to performance degradation, so we’re excited to release Gemma 3 models that are robust to quantization. We released several quantized variants for each Gemma 3 model to enable inference with your favorite inference engine, such as Q4_0 (a common quantization format) for Ollama, llama.cpp, and MLX.</p><p data-block-key=\"epsbi\"><b>How do we maintain quality?</b> We use QAT. Instead of just quantizing the model after it's fully trained, QAT incorporates the quantization process during training. QAT simulates low-precision operations during training to allow quantization with less degradation afterwards for smaller, faster models while maintaining accuracy. Diving deeper, we applied QAT on ~5,000 steps using probabilities from the non-quantized checkpoint as targets. We reduce the perplexity drop by 54% (using llama.cpp perplexity evaluation) when quantizing down to Q4_0.</p><h2 data-block-key=\"eatdo\">See the Difference: Massive VRAM Savings</h2><p data-block-key=\"9f9so\">The impact of int4 quantization is dramatic. Look at the VRAM (GPU memory) required just to load the model weights:</p><ul><li data-block-key=\"41cf1\"> Drops from 54 GB (BF16) to just  (int4)</li></ul><ul><li data-block-key=\"5uebr\"> Shrinks from 24 GB (BF16) to only  (int4)</li></ul><ul><li data-block-key=\"9d985\"> Reduces from 8 GB (BF16) to a lean  (int4)</li></ul><ul><li data-block-key=\"bf7p\"> Goes from 2 GB (BF16) down to a tiny  (int4)</li></ul></div><div><blockquote data-block-key=\"7ui9z\"><i><sup>This figure only represents the VRAM required to load the model weights. Running the model also requires additional VRAM for the KV cache, which stores information about the ongoing conversation and depends on the context length</sup></i></blockquote><h2 data-block-key=\"e1hmg\">Run Gemma 3 on Your Device</h2><p data-block-key=\"4jdc3\">These dramatic reductions unlock the ability to run larger, powerful models on widely available consumer hardware:</p><ul><li data-block-key=\"bqsl5\"> Now fits comfortably on a single desktop NVIDIA RTX 3090 (24GB VRAM) or similar card, allowing you to run our largest Gemma 3 variant locally.</li></ul><ul><li data-block-key=\"c4adc\"> Runs efficiently on laptop GPUs like the NVIDIA RTX 4060 Laptop GPU (8GB VRAM), bringing powerful AI capabilities to portable machines.</li></ul><ul><li data-block-key=\"be3pr\"> Offer even greater accessibility for systems with more constrained resources, including phones and <a href=\"https://youtu.be/lgsD_wSZ0hI?si=pyQj23bOxNPLrxtL&amp;t=102\">toasters</a> (if you have a good one).</li></ul><h2 data-block-key=\"7c8ds\">Easy Integration with Popular Tools</h2><p data-block-key=\"2324e\">We want you to be able to use these models easily within your preferred workflow. Our official int4 and Q4_0 unquantized QAT models are available on Hugging Face and Kaggle. We’ve partnered with popular developer tools that enable seamlessly trying out the QAT-based quantized checkpoints:</p><ul><li data-block-key=\"avkt\"><a href=\"https://ollama.com/library/gemma3\"></a> Get running quickly – all our Gemma 3 QAT models are natively supported starting today with a simple command.</li></ul><ul><li data-block-key=\"6sp3o\"><a href=\"https://lmstudio.ai/model/gemma-3-12b-it-qat\"></a> Easily download and run Gemma 3 QAT models on your desktop via its user-friendly interface.</li></ul><ul><li data-block-key=\"69oug\"><a href=\"https://huggingface.co/collections/mlx-community/gemma-3-qat-68002674cd5afc6f9022a0ae\"></a> Leverage MLX for efficient, optimized inference of Gemma 3 QAT models on Apple Silicon.</li></ul><ul><li data-block-key=\"19s6q\"><a href=\"https://www.kaggle.com/models/google/gemma-3/gemmaCpp\"></a> Use our dedicated C++ implementation for highly efficient inference directly on the CPU.</li></ul><ul><li data-block-key=\"f05gl\"><a href=\"https://huggingface.co/collections/google/gemma-3-qat-67ee61ccacbf2be4195c265b\"></a> Integrate easily into existing workflows thanks to native support for our GGUF-formatted QAT models.</li></ul><h2 data-block-key=\"c5073\">More Quantizations in the Gemmaverse</h2><p data-block-key=\"74vnv\">Our official Quantization Aware Trained (QAT) models provide a high-quality baseline, but the vibrant <a href=\"https://ai.google.dev/gemma/gemmaverse\">Gemmaverse</a> offers many alternatives. These often use Post-Training Quantization (PTQ), with significant contributions from members such as <a href=\"https://huggingface.co/bartowski/google_gemma-3-27b-it-GGUF\">Bartowski</a>, <a href=\"https://huggingface.co/collections/unsloth/gemma-3-67d12b7e8816ec6efa7e4e5b\">Unsloth</a>, and <a href=\"https://huggingface.co/collections/ggml-org/gemma-3-67d126315ac810df1ad9e913\">GGML</a> readily available on Hugging Face. Exploring these community options provides a wider spectrum of size, speed, and quality trade-offs to fit specific needs.</p><p data-block-key=\"fdu54\">Bringing state-of-the-art AI performance to accessible hardware is a key step in democratizing AI development. With Gemma 3 models, optimized through QAT, you can now leverage cutting-edge capabilities on your own desktop or laptop.</p><p data-block-key=\"179dk\">Explore the quantized models and start building:</p><p data-block-key=\"4j3l0\">We can't wait to see what you build with Gemma 3 running locally!</p></div>","contentLength":6308,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43743337"},{"title":"Show HN: I built an AI that turns GitHub codebases into easy tutorials","url":"https://github.com/The-Pocket/Tutorial-Codebase-Knowledge","date":1745096681,"author":"zh2408","guid":193,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43739456"},{"title":"Raspberry Pi Lidar Scanner","url":"https://github.com/PiLiDAR/PiLiDAR","date":1745088812,"author":"Venn1","guid":237,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43738561"},{"title":"Librarians are dangerous","url":"https://bradmontague.substack.com/p/librarians-are-dangerous","date":1745074176,"author":"mooreds","guid":236,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43736791"},{"title":"Claude Code: Best practices for agentic coding","url":"https://www.anthropic.com/engineering/claude-code-best-practices","date":1745059710,"author":"sqs","guid":235,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43735550"},{"title":"Cozy video games can quell stress and anxiety","url":"https://www.reuters.com/business/retail-consumer/cozy-video-games-can-quell-stress-anxiety-2025-01-27/","date":1745022073,"author":"vinhnx","guid":234,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43733097"},{"title":"15,000 lines of verified cryptography now in Python","url":"https://jonathan.protzenko.fr/2025/04/18/python.html","date":1745004524,"author":"todsacerdoti","guid":233,"unread":true,"content":"<p>In November 2022, I opened <a href=\"https://github.com/python/cpython/issues/99108\">issue 99108</a> on\nPython’s GitHub repository, arguing that after a recent CVE in its implementation of\nSHA3, Python should embrace verified code for all of its hash-related infrastructure.</p><p>As of last week, this issue is now closed, and every single hash and HMAC algorithm exposed by\ndefault in Python is now provided by <a href=\"https://github.com/project-everest/hacl-star/\">HACL*</a>, the\nverified cryptographic library. There was no loss of functionality, and the transition was entirely\ntransparent for Python users. Python now vendors (includes in its repository) 15,000 lines of\nverified C code from HACL*. Pulling newer versions from the upstream HACL* repository\nis entirely automated and is done by invoking a script. HACL* was able to successfully implement\nnew features to meet all of the requirements of Python, such as: additional modes for the Blake2\nfamily of algorithms, a new API for SHA3 that covers all Keccak variants, strict abstraction\npatterns to deal with build system difficulties, proper error management (notably, allocation\nfailures), and instantiating HACL’s generic “streaming” functionality with the HMAC algorithm,\nincluding an optimization that requires keeping two hash states at once.</p><p>This is the culmination of 2.5 years of work, and could not have happened without the invaluable\nhelp of <a href=\"https://aymericfromherz.github.io/\">Aymeric Fromherz</a>, who shouldered a lot of the\nimplementation burden. <a href=\"https://www.sonho.fr/\">Son Ho</a> had a key contribution early on, generalizing\nHACL’s “streaming” functionality to be able to handle block algorithms that require a “pre-input”.\nThis slightly obscure generalization was actually essential to implement a suitable, optimized HMAC\nthat keeps two hash states under the hood. On the Python side, Gregory P. Smith, Bénédikt Tran, and\nlater Chris Eibl were big champions and provided a lot of help. Finally, the HACS series of\nworkshops created connections (hello, Paul Kehrer!) and provided sufficient momentum to make this\nhappen. A warm thank you to both the Python and verified cryptographic communities!</p><p>As I oftentimes like to do, I’ll provide a little bit of a look behind the scenes, and comment on\nsome of the more interesting technical aspects that are too low-level for a research paper.</p><h2>A Primer on Streaming APIs</h2><p>Many cryptographic algorithms are  algorithms, meaning that they assume their input is\nprovided block by block, with special treatment for the first and last blocks. Well-known block\nalgorithms include hash algorithms, MAC algorithms (e.g. Poly1305, HMAC), and more. In practice, the\nblock API is not user-friendly: rarely does one have the data already chunked in blocks;\nfurthermore, computing a result (e.g., a hash) invalidates the state of the block algorithm, which\nmakes e.g. computing the intermediary hashes of the TLS transcript difficult.</p><p>For these reasons, cryptographic libraries typically expose  APIs, meaning clients can\nprovide inputs of any length; the library then takes care of buffering the input, flushing the\nbuffer as soon as a full block is obtained. A streaming API typically also allows extracting\nintermediary hashes without invalidating the state.</p><p>Streaming APIs are hard, because they manipulate long-lived state with complex invariants: the\n(unverified) reference implementation of SHA3 was hit with a <a href=\"https://nvd.nist.gov/vuln/detail/cve-2022-37454\">bad\nCVE</a> in 2022, which Python “inherited”, because it\nvendored that very same SHA3 implementation.</p><p>Streaming APIs are hard also because the\nunderlying block algorithms differ in a myriad of different ways: all hash algorithms accept an\nempty final block,  for Blake2; some need to retain the key at run-time (Poly1305), some can discard it\nafter initialization (HMAC, optimized); some need some initial input before processing the key\n(Blake2), some don’t; and so on.</p><p>Given this inherent complexity, streaming algorithms are a good candidate for verification: we wrote\na <a href=\"https://arxiv.org/abs/2102.01644\">research paper</a> in 2021 about this very problem.</p><h2>Fully generic verification</h2><p>The main idea from the paper is that one can capture, using dependent types, what a block algorithm\n. Once that’s done, it suffices to author and verify a generic streaming construction once and\nfor all over an abstract definition of block algorithms. Then, just like you instantiate a template\nin C++, you apply the generic streaming construction to a concrete block API and voilà – a\nstreaming API for that one block algorithm, “for free”.</p><p>The fist hitch is that there’s quite a big delta between what we presented in the paper (Listing\n12), and <a href=\"https://github.com/hacl-star/hacl-star/blob/897e23d315c08f7a375408d60d1a4918477fcaa0/code/streaming/Hacl.Streaming.Interface.fsti#L254\">what actually lives in the\nrepository</a>.\nSpecifically, capturing  block algorithm requires a lot of genericity.</p><ul><li>The user may or may not specify the length of the final digest – for instance,\neach SHA3 hash has a fixed output length, but the Shake variants produce a result whose length is\nuser-provided.</li><li>The block algorithm may expect to receive a pre-input before the blocks of data. For e.g. SHA2,\nthe pre-input is empty, but for Blake2 in keyed hash mode, the pre-input is the key block.</li><li>Blocks cannot be processed eagerly, because some algorithms (Blake2) do not allow for the final\nblock to be empty – this vastly complicates buffer management, and interacts with the pre-input.</li><li>Some algorithms need to retain extra pieces of state: for instance, the key length for Blake2 can\nbe tweaked at initialization-time, but needs to be retained in the long-lived state.</li><li>To avoid invalidating the block state upon intermediary digest extraction, our streaming API\ncopies the state under the hood – in some cases, it’s easier to stack-allocate this copy, but in\nother cases, a heap-allocated copy makes more sense.</li><li>In some cases, we wanted one API per algorithm (we have four APIs for\nSHA2-{224,256,384,512}); in other cases, we wanted one API per algorithm family (we have one API\nthat covers all 6 Keccak algorithms: 4 variants of SHA3, and 2 variants of Shake).</li></ul><p>Getting to that level of genericity took multiple rounds, driven by the successive requirements of\nPython. Ultimately, for HMAC, which was the final algorithm we landed in Python, we realized that\nour proofs and definitions were generic enough that we did not need any further tweaks to\n“instantiate” our generic streaming API with HMAC.</p><p>One highlight of submitting a PR to Python is that their infrastructure has more CI coverage than we\ncould possibly dream of: a complete build of Python runs over 50+ toolchains and architectures. The\nflipside? We discovered some pretty annoying corner cases.</p><p>One particularly tricky build issue surfaced when dealing with HMAC. As a reminder,\n<a href=\"https://en.wikipedia.org/wiki/HMAC\">HMAC</a> is a generic construction that, given a hash algorithm,\nprovides a keyed message authentication code – in short, there is a high-level HMAC piece of code\nthat defers most of the work to individual hash algorithms. Each hash algorithm may itself come in a\nvariety of : for instance, HMAC-Blake2b is implemented both by HMAC-Blake2b-32\n(regular implementation) and HMAC-Blake2b-256 (AVX2 wide-vector implementation).</p><p>This already causes problems:  may call functions from , if Python is running\non a machine with AVX2. However, only  may be compiled with : code from\n will execute on all machines, even those without AVX2, meaning it must  be compiled\nwith . So far, so good, and this is something we had done before.</p><p>The problem came with  creating the initial state for :</p><div><div><pre><code></code></pre></div></div><p>Most toolchains were happy with this code –  defines the type , and even\nthough  cannot assume AVX2 instructions are available, it’s not to hard for a\ncompiler to zero-initialize  without resorting to AVX2 instructions… except,\nsome older compilers refused to process the  header unless  was used, which\ndefeated the whole purpose.</p><p>This required a considerable amount of refactoring to use the well-known “C abstract struct”\npattern, which essentially defines an abstract type in C.</p><div><div><pre><code></code></pre></div></div><p>What made this extra difficult is that the C code is auto-generated from F*, which has a \ndifferent notion of abstraction. The compiler that goes from F* to C,\n<a href=\"https://github.com/FStarLang/karamel/\">krml</a>, had to be overhauled to perform a much more\nfine-grained analysis that handles various levels of visibility (public functions, library-internal\nfunctions, translation-unit internal functions) even in the presence of such “abstract structs”.</p><h2>Handling memory allocation failures</h2><p>While our original modeling of C in F* allowed reasoning about memory allocation failures, no one\nhad ever bothered to do so in practice. For Python, it was desirable to be able to propagate memory\nallocation failures. This meant we had to refine our definition of a generic, mutable piece of state\n(such as the block state); our definition of a block algorithm (such as SHA2-256); and our generic\nstreaming construction to all be able to propagate memory allocation failures all the way up to the\ncaller. Thankfully, this didn’t turn out to be a huge deal: we inserted  types all along the\nway, and because we had one single generic streaming construction, the implementation and proofs had\nto be updated only once for the 15+ concrete instances of the streaming API.</p><p>The presence of  types in the source compiles to tagged unions in the generated C; this is a\nlittle verbose, and we may change our definition of a piece of state to feature a \nrun-time function that can assess whether a memory allocation failed, at the expense of more\ncomplexity and verification effort.</p><h2>Propagating changes from upstream HACL* to Python</h2><p>My initial Python PR contained a shell script that would fetch the required files from the upstream\nHACL* repository; ditch a bunch of superfluous definitions in headers via well-crafted sed\ninvocations; and tweak a few include paths in-place, also using my favorite refactoring tool (yes,\nsed). The benefit was the the initial PR was lean and clean.</p><p>Later on, once it became clear that the upstream code was maintainable and pretty stable, that pile\nof seds was eliminated, on the basis that it’s not the end of the world if a header contains a few\nextra definitions, and it all makes maintenance easier.</p><p>Now, anyone who wishes to refresh HACL* can run the shell script in their checkout of Python, and\nprovided they tweak the expected hash in Python’s SBOM (software bill of materials), they are good\nto go and can integrate the latest improvements.</p><p>I’m delighted to see such a large-scale integration of verified cryptographic code in a flagship\nproject like Python. This demonstrates that verified cryptographic is not only ready from an\nacademic perspective, but also mature enough to be integrated in real-world software while meeting\nall engineering expectations. Thanks to everyone who helped along this journey!</p>","contentLength":10557,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43731165"},{"title":"Judge Rules Blanket Search of Cell Tower Data Unconstitutional","url":"https://www.404media.co/judge-rules-blanket-search-of-cell-tower-data-unconstitutional/","date":1745000187,"author":"bradac56","guid":232,"unread":true,"content":"<div>Judge says tower dumps violate the 4th amendment, but will let the cops do it this one time, as a treat.</div>","contentLength":104,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43730545"},{"title":"Show HN: I made a Doom-like game fit inside a QR code","url":"https://github.com/Kuberwastaken/backdooms","date":1744994425,"author":"kuberwastaken","guid":189,"unread":true,"content":"<p>I sometimes pick up random projects just because I can, this was one of those times. I made it as a week long project a while back this year but never shared here, so thought to go for it haha.</p><p>I created a game inspired by Doom and the backrooms called The Backdooms under 2.4kb in minified html. (for reference, this entire post would be around 1.8kB haha)\nI had to use a not popular way of using GZip with Zlib headers (had to write my own script for compressing it, also in the repo) to eventually convert it a size 40 QR code that works right in your browser using Decompressionstream API.</p><p>This is of course a very oversimplified description of it, using a lot of the same technologies that DOOM had but combining it with infinite seed based map generation in 2.4kb (QR codes can only store 3kb, which includes changing formats) was pretty hard.</p><p>Here are some links about it if you want to nerd out and read more:</p><p>(PS: You'd need something like <a href=\"https://qrscanner.org/\" rel=\"nofollow\">https://qrscanner.org/</a> or something that can scan bigger QR codes and put the text data onto your browser to play it)</p><p>My Blogs documenting the process and development in detail:</p>","contentLength":1121,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43729683"},{"title":"Kagi Assistant is now available to all users","url":"https://blog.kagi.com/assistant-for-all","date":1744949541,"author":"angilr","guid":231,"unread":true,"content":"<p>At Kagi, our mission is simple: to humanise the web. We want to deliver a search experience that prioritises human needs, allowing you to explore the web effectively, privately, and without manipulation. We evaluate new technologies not for their acclaim but for their true potential to support our mission.</p><p>Since its launch, Kagi Assistant has been a favorite for many users as it allows access to world top large language models, grounded in Kagi Search, all in one place in one beautiful user interface - and all that for +$15/mo upgrade from our Professional plan that provides unlimited Kagi Search.</p><p>Today, we’re excited to announce that <a href=\"https://kagi.com/assistant\">Kagi Assistant</a> is now available to all users across all plans, expanding from its previous exclusivity to <a href=\"https://kagi.com/signup?plan_id=ultimate\">Ultimate</a> subscribers, as an added value to all Kagi customers, without increasing the price.</p><p> We are enabling the Assistant for all users in phases, based on regions, starting with USA today. The full rollout for ‘Assistant for All’ is scheduled to be completed by Sunday, 23:59 UTC.</p><ol><li>AI serves a defined, search-relevant context: Kagi Assistant is a research aid.</li><li>AI enhances, it doesn’t replace: Kagi Search remains our core offering, functioning independently. Kagi Assistant is an optional tool you can use as needed.</li><li>AI should enhance humanity, not diminish it: Our goal is to improve your research process by helping you synthesise information or explore topics grounded in Kagi Search results, not to replace your critical thinking.</li></ol><p>Kagi Assistant embodies these principles, working within the context of Kagi’s search results to provide a new way to interact with information. It’s built to make research easier while respecting your privacy and AI’s limits.</p><p>By making Kagi Assistant available to everyone, we’re giving all users the choice to explore this capability as part of their Kagi toolkit - at no additional cost to their subscription. Use it when and how it suits your workflow, knowing it’s built with privacy, responsibility, and human-centric values at its core.</p><h2>Let’s talk about the specifics!</h2><h3>AI grounded in Kagi search, guided by you</h3><p>When you enable web access, the Assistant has access to Kagi Search results. It will also respect your <a href=\"https://help.kagi.com/kagi/features/website-info-personalized-results.html\">personalised domain rankings</a> and allows the use of <a href=\"https://help.kagi.com/kagi/features/lenses.html\">Lenses</a> to narrow search scope.</p><p>Or, if you’d prefer to discuss directly with the model, you can also turn off web access. It also supports file uploads, allowing you to provide additional context or information for your queries.</p><h3>Custom assistants tailored to your needs</h3><p>Create <a href=\"https://help.kagi.com/kagi/ai/custom-assistants.html\">specialized assistants</a> with unique instructions, defining their purpose, context, and web access preferences. Need help with coding, grammar reviews, or diagnosing an issue with your classic VW Bus? Build an assistant for it.</p><p>Pro-tip: assign a custom bang (!name) for instant access via your browser’s search bar.</p><h3>Refine and redirect with editing</h3><p>Conversations don’t always go as planned. If a response misses the mark, Kagi Assistant lets you edit prompts, switch models, or adjust settings mid-thread. This ensures you stay in control and can redirect the conversation without starting over.</p><p>Your privacy is our priority. Assistant threads are private by default, automatically expire based on your settings, and your interaction data is not used to train AI models.  This applies to both Kagi and third-party providers, under strict contractual terms.</p><h3>A note on our fair-use policy</h3><p>Providing powerful AI tools requires significant resources. To ensure sustainability, we’re starting to enforce our <a href=\"https://kagi.com/privacy#Terms-of-use\">fair-use policy</a>.</p><p>Basically our policy states that you can use AI models based on your plan’s value. For example, a $25 monthly plan allows up to $25 worth of raw token cost across all models (there is a 20% built-in margin that we reserve for providing searches, development and infrastructure for the service). From our token usage statistics, 95% of users should never hit this limit.</p><p>While most users won’t be affected, those exceeding the generous threshold will have the possibility to renew their subscription cycle instantly. Soon, we’ll introduce credit top-ups for added flexibility. This approach ensures a fair, user-funded model while maintaining quality service and is a simple way to control usage, compared to arbitrary usage limits found in other services.</p><h2>Your favourite models are waiting for you</h2><p>Choose from a range of leading LLMs from OpenAI, Anthropic, Google, Mistral, and more. You can switch models mid-thread and explore their performance through our regularly updated <a href=\"https://help.kagi.com/kagi/ai/llm-benchmark.html\">open-source LLM benchmark</a>.  Choice of models in non-Ultimate plans will be limited compared to our full offering in the Ultimate plan, please see below.</p><p>Access to your favourite LLMs makes Kagi Assistant mould to your requirements and query customisations, so we feature an array of models for you to choose from.</p><table><tbody><tr></tr><tr><td>Claude 3.7 Sonnet with extended thinking</td></tr><tr></tr><tr><td>DeepSeek R1 Distill Llama 70B</td></tr></tbody></table><p>This is just the beginning for Kagi Assistant. Explore more in our <a href=\"https://help.kagi.com/kagi/ai/assistant.html\">documentation</a>.</p><p>Happy fetching,\nTeam Kagi.</p><p><strong>Q: Does using a less costly model (like DeepSeek) compared to larger ones use fewer credits?</strong> Yes. The fair use policy calculates usage based on the actual cost charged by the model provider. Therefore, using smaller, less expensive models will allow for significantly more token usage compared to larger models.</p><p><strong>Q: Does Kagi receive discounted rates from AI model providers?</strong> No, Kagi does not receive discounts. However, we utilize smart caching techniques for the models to reduce operational costs, and these savings are passed on to the user.</p><p><strong>Q: Why did Kagi start enforcing the fair use policy?</strong> The policy was enforced due to excessive use. For instance, the top 10 users accounted for approximately 14% of the total costs, with some individuals consistently using up to 50 million tokens per week on the most advanced models. Our profit margins are already quite narrow. 95% of users should never hit any usage limits.</p><p><strong>Q: What is the specific usage limit?</strong> The limit corresponds directly to the monetary value of your Kagi plan, converted into an equivalent token amount. For example, a $25 plan provides $25 worth of token usage. This calculation includes a 20% margin for Kagi to cover search provision, development, and infrastructure costs. Savings achieved through prompt caching and other optimizations are passed on to you.</p><p><strong>Q: Where can I view my token usage?</strong> Currently, you can monitor your token usage on the Consumption page: <a href=\"https://kagi.com/settings?p=consumption\">https://kagi.com/settings?p=consumption</a>. We plan to display cost and interaction details more prominently soon, potentially on the billing page or directly within the Assistant interface.</p><p><strong>Q: I can not access Assistant!</strong>\nA: We are doing staged rollout beginning with USA, full rollout scheduled by Sunday, 23:59 UTC. This will include other regions and even the trial plan.</p>","contentLength":6836,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43724941"},{"title":"Potatoes in the Mail","url":"https://facts.usps.com/mailing-potatoes/","date":1744925745,"author":"mooreds","guid":230,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43722486"},{"title":"Gemini 2.5 Flash","url":"https://developers.googleblog.com/en/start-building-with-gemini-25-flash/","date":1744916619,"author":"meetpateltech","guid":229,"unread":true,"content":"<img src=\"https://storage.googleapis.com/gweb-developer-goog-blog-assets/images/gemini_2.5_momentum_1600-476.original.png\" alt=\"Gemini 2.5 Flash ai.dev\"><div><p data-block-key=\"w22bj\">Today we are rolling out an early version of  in  through the Gemini API via <a href=\"https://aistudio.google.com/prompts/new_chat?model=gemini-2.5-flash-preview-04-17\">Google AI Studio</a> and <a href=\"https://console.cloud.google.com/vertex-ai/studio/multimodal?model=gemini-2.5-flash-preview-04-17\">Vertex AI</a>. Building upon the popular foundation of 2.0 Flash, this new version delivers a major upgrade in reasoning capabilities, while still prioritizing speed and cost. Gemini 2.5 Flash is our first fully hybrid reasoning model, giving developers the ability to turn thinking on or off. The model also allows developers to set thinking budgets to find the right tradeoff between quality, cost, and latency. Even with  developers can maintain the fast speeds of 2.0 Flash, and improve performance.</p><p data-block-key=\"b171q\">Our Gemini 2.5 models are thinking models, capable of reasoning through their thoughts before responding. Instead of immediately generating an output, the model can perform a \"thinking\" process to better understand the prompt, break down complex tasks, and plan a response. On complex tasks that require multiple steps of reasoning (like solving math problems or analyzing research questions), the thinking process allows the model to arrive at more accurate and comprehensive answers. In fact, Gemini 2.5 Flash performs strongly on <a href=\"https://lmarena.ai/?leaderboard\">Hard Prompts in LMArena</a>, second only to 2.5 Pro.</p></div><div><h2 data-block-key=\"w22bj\">Our most cost-efficient thinking model</h2><p data-block-key=\"15dd0\">2.5 Flash continues to lead as the model with the best price-to-performance ratio.</p></div><div><h2 data-block-key=\"hippi\">Fine-grained controls to manage thinking</h2><p data-block-key=\"4g2lu\">We know that different use cases have different tradeoffs in quality, cost, and latency. To give developers flexibility, we’ve enabled setting a  that offers fine-grained control over the maximum number of tokens a model can generate while thinking. A higher budget allows the model to reason further to improve quality. Importantly, though, the budget sets a cap on how much 2.5 Flash can think, but the model does not use the full budget if the prompt does not require it.</p></div><div><p data-block-key=\"hippi\">The model is trained to know how long to think for a given prompt, and therefore automatically decides how much to think based on the perceived task complexity.</p><p data-block-key=\"c6ud\">If you want to keep the lowest cost and latency while still improving performance over 2.0 Flash, <b>set the thinking budget to 0.</b> You can also choose to <b>set a specific token budget</b> for the thinking phase using a parameter in the API or the slider in Google AI Studio and in Vertex AI. The budget can range from 0 to 24576 tokens for 2.5 Flash.</p><p data-block-key=\"bm9va\">The following prompts demonstrate how much reasoning may be used in the 2.5 Flash’s default mode.</p><h3 data-block-key=\"4qsi3\"><b>Prompts requiring low reasoning:</b></h3><p data-block-key=\"ee1fc\"> “Thank you” in Spanish</p><p data-block-key=\"dfdib\"> How many provinces does Canada have?</p><h3 data-block-key=\"5r2iv\"><b>Prompts requiring medium reasoning:</b></h3><p data-block-key=\"2hnrv\"> You roll two dice. What’s the probability they add up to 7?</p><p data-block-key=\"t908\"> My gym has pickup hours for basketball between 9-3pm on MWF and between 2-8pm on Tuesday and Saturday. If I work 9-6pm 5 days a week and want to play 5 hours of basketball on weekdays, create a schedule for me to make it all work.</p><h3 data-block-key=\"6ooqr\"><b>Prompts requiring high reasoning:</b></h3><p data-block-key=\"99tu\"> A cantilever beam of length L=3m has a rectangular cross-section (width b=0.1m, height h=0.2m) and is made of steel (E=200 GPa). It is subjected to a uniformly distributed load w=5 kN/m along its entire length and a point load P=10 kN at its free end. Calculate the maximum bending stress (σ_max).</p><p data-block-key=\"c8ugt\"> Write a function <code>evaluate_cells(cells: Dict[str, str]) -&gt; Dict[str, float]</code> that computes the values of spreadsheet cells.</p><ul><li data-block-key=\"7pvlf\">Or a formula like  using , , , and other cells.</li></ul><ul><li data-block-key=\"p7co\">Resolve dependencies between cells.</li></ul><ul><li data-block-key=\"b35hd\">Handle operator precedence ( before ).</li></ul><ul><li data-block-key=\"b432o\">Detect cycles and raise <code>ValueError(\"Cycle detected at &lt;cell&gt;\")</code>.</li></ul><ul><li data-block-key=\"2884i\">No . Use only built-in libraries.</li></ul><h2 data-block-key=\"nq6j\">Start building with Gemini 2.5 Flash today</h2><p data-block-key=\"erb39\">Gemini 2.5 Flash with thinking capabilities is now available in preview via the <a href=\"https://ai.google.dev/gemini-api/docs/thinking\">Gemini API</a> in <a href=\"https://aistudio.google.com/prompts/new_chat?model=gemini-2.5-flash-preview-04-17\">Google AI Studio</a> and in <a href=\"https://console.cloud.google.com/vertex-ai/studio/multimodal?model=gemini-2.5-flash-preview-04-17\">Vertex AI</a>, and in a dedicated dropdown in the <a href=\"http://gemini.google.com/\">Gemini app</a>. We encourage you to experiment with the  parameter and explore how controllable reasoning can help you solve more complex problems.</p></div><div><div><pre></pre></div></div><div><p data-block-key=\"637cu\">We will continue to improve Gemini 2.5 Flash, with more coming soon, before we make it generally available for full production use.</p><p data-block-key=\"7esdg\"><sub><sup>Model pricing is sourced from Artificial Analysis &amp; Company Documentation</sup></sub></p></div>","contentLength":4061,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43720845"},{"title":"Google is illegally monopolizing online advertising tech, judge rules","url":"https://www.nytimes.com/2025/04/17/technology/google-ad-tech-antitrust-ruling.html","date":1744901266,"author":"IdealeZahlen","guid":228,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43717705"},{"title":"TikTok is harming children at an industrial scale","url":"https://www.afterbabel.com/p/industrial-scale-harm-tiktok","date":1744897168,"author":"cwwc","guid":227,"unread":true,"content":"<p><a href=\"https://www.scotusblog.com/case-files/cases/tiktok-inc-v-garland/\" rel=\"\">a law</a><a href=\"https://www.npr.org/2024/04/24/1246663779/biden-ban-tiktok-us\" rel=\"\">ban TikTok from operating</a><a href=\"https://edition.cnn.com/2024/10/08/tech/tiktok-sued-14-states-childrens-mental-health/index.html\" rel=\"\">14 state Attorneys General</a></p><p>The upcoming ban will also be adjudicated in the court of public opinion as Americans try to decide whether the loss of access to TikTok would be a reason to protest or celebrate. In this post we argue that Americans should welcome the disappearance of TikTok because the company is causing harm to children, adolescents, and young adults at an industrial scale. </p><p>Our evidence comes mostly from research done by those 14 Attorneys General. Some of their briefs have been posted online for the world to see. The briefs include hundreds of quotations from internal reports, memos, Slack conversations, and public statements in which executives and employees of TikTok acknowledge and discuss the harms that their company is causing to children. We organize the evidence into five clusters of harms:</p><ol><li><p>Addictive, compulsive, and problematic use</p></li><li><p>Depression, anxiety, body dysmorphia, self-harm, and suicide</p></li><li><p>Porn, violence, and drugs</p></li><li><p>Sextortion, CSAM, and sexual exploitation</p></li><li><p>TikTok knows about underage use and takes little action</p></li></ol><p><em>company insiders were aware of multiple widespread and serious harms,</em></p><blockquote><p><strong>“Compulsive usage correlates with a slew of negative mental health effects like loss of analytical skills, memory formation, contextual thinking, conversational depth, empathy, and increased anxiety,”</strong><strong>“interfer[ing] with essential personal responsibilities like sufficient sleep, work/school responsibilities, and connecting with loved ones.”</strong></p></blockquote><p>Although these harms are known, the company often chooses not to act. For example, one TikTok employee explained,</p><blockquote><p><strong>“[w]hen we make changes, we make sure core metrics aren’t affected.”</strong><strong>“[l]eaders don’t buy into problems” </strong><strong> “not a priority for any other team.”</strong></p></blockquote><blockquote><p><strong>“[f]amilies do not use Family Pairing”</strong><strong> “Family Pairing doesn’t address parents’ top concerns,”</strong><strong>“inappropriate content, offensive interactions, and lack of privacy.</strong></p></blockquote><p><strong> “Normalization of Pedophilia”</strong><strong>“Minor Sexual Solicitation”</strong><strong>“leading minors off platform”</strong><strong>“Glorification of Minor Sexual Assault”</strong></p><p><a href=\"https://www.npr.org/2024/10/11/g-s1-27676/tiktok-redacted-documents-in-teen-safety-lawsuit-revealed\" rel=\"\">improperly redacted</a></p><p><a href=\"https://linknky.com/news/2024/10/09/tiktok-lawsuit-kentucky-attorney-general/\" rel=\"\">try it yourself</a><a href=\"https://www.dropbox.com/scl/fi/sfxbtc79imdvm4nmnjcnz/tiktok.kentuckyAG.unredacted.complete.ANNOTATED-edited.pdf?rlkey=z74c83rziez1vd68ii8boepi8&amp;e=1&amp;st=k5gch683&amp;dl=0\" rel=\"\">our version</a></p><p><a href=\"https://docs.google.com/document/d/1WPBIFGBuLb6fmwOYYl06vXWEyQWbnqVDORMNxBQtz1c/edit?tab=t.0\" rel=\"\">a separate Google doc.</a></p><p><em></em></p><p><em><a href=\"https://www.pewresearch.org/internet/2024/12/12/teens-social-media-and-technology-2024/#:~:text=Most%20teens%20use%20social%20media,asked%20about%20in%20our%20survey.\" rel=\"\">2024 report from Pew</a></em><em> Below you can see that TikTok is aiming to create just such compulsive use, which in turn can lead to problematic use disorders and behavioral addictions, which then compound the harms in the other four clusters. The company does this even though many of its employees believe their product is bad for children’s development.]</em></p><ul><li><ul><li><p>TikTok’s executives and employees have admitted that they target young Americans, stating:</p><ul><li><p><strong>“It’s better to have young people as an early adopter, especially the teenagers in the U.S. Why? They [sic] got a lot of time.</strong></p></li><li><p><strong>Teenagers in the U.S. are a golden audience . . . . If you look at China, the teenage culture doesn’t exist — the teens are super busy in school studying for tests, so they don’t have the time and luxury to play social media apps</strong></p></li></ul></li></ul></li><li><p>KY P. 8, PARA 19 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p>TikTok knows that the harmful effects of its Platform wreak havoc on the mental health of millions of American children and teenagers and harms them. Its executives have admitted:</p><ul><li><p><strong>“The product in itself has baked into it compulsive use.</strong></p></li><li><p><strong>The reason kids watch TikTok is because the algo[rithm] is really good. . . . But I think we need to be cognizant of what it might mean for other opportunities. And when I say other opportunities, I literally mean sleep, and eating, and moving around the room, and looking at somebody in the eyes.</strong></p></li></ul></li></ul></li><li><p>KY P. 20, PARA 64 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>arms race for attention[.]</strong></p></li><li><p><em>[Below is a redacted graph from para 67 of KY brief. It shows that TikTok has reached saturation among the 29.7 million US users under the age of 17 who own a smartphone. This means that they can’t get more young users, but they can get more time out of each user, especially if they pull them away from competing platforms.]</em></p></li></ul></li></ul><ul><li><p>KY P. 40, PARA 121 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>“As expected, across most engagement metrics, the younger the user the better the performance.”</strong></p></li></ul></li><li><p>KY P.40, PARA 125 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><em>[internal TikTok group studying issues affecting TikTok]</em><strong>“Tiktok is particularly popular with younger users who are particularly sensitive to reinforcement in the form of social reward and have minimal ability to self-regulate effectively.”</strong></p></li></ul></li><li><p>KY P. 55, PARA 181 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>Activate &amp; Engage users with the right content at the right time, to encourage users to open the App more and stay longer.”</strong><strong>activate users so they will return to the app.</strong></p></li></ul></li><li><p>KY P. 67, PARA 223 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>TikTok’s success can largely be attributed to strong out of the box personalization and automation, which limits user agency</strong></p></li></ul></li></ul><ul><li><ul><li><p><strong>“addiction and impulsive purchasing of virtual items,”</strong></p></li></ul></li></ul><ul><li><ul><li><p><strong>“fully leaned in and immersed compared to other platforms.” </strong><strong> “the leading platform for Information Density”</strong><strong> “algorithm and shorter video formats” </strong><strong> “create continuous cycles of engagement.”</strong></p></li></ul></li><li><ul><li><p><strong>“can largely be attributed to strong . . . personalization and automation, which limits user agency”</strong><strong> “product experience utiliz[ing] many coercive design tactics,”</strong><strong>[i]nfinite scroll, auto-play, constant notifications,” </strong><strong>“the ‘slot machine’ effect”</strong><strong>“can be considered manipulative.”</strong></p></li></ul></li><li><ul><li><p><strong>“particularly sensitive to reinforcement in the form of social award,”</strong><strong>“minimal ability to self-regulate effectively,”</strong><strong>“do not have executive function to control their screen time.”</strong></p></li></ul></li><li><ul><li><p><strong> “TikTok is in most people’s lives like this,” </strong><strong>“go on tiktok for 5 mins and 3 hours have passed” and “my night routine: watch 3 hours of tiktok videos, try to follow the dance steps, realise u suck at dancing n cry about it, continue watching tiktok videos, sleep.”</strong></p></li></ul></li><li><ul><li><p><strong>TikTok is particularly popular with younger users, who are seen as more vulnerable to online harms and the negative impacts of compulsive use.”</strong></p></li></ul></li><li><ul><li><p><strong> “negative emotions,” “interfered with [users’] obligations and productivity,” and led to “negative impacts . . . on their lives,” </strong><strong> “lost sleep, missed deadlines, poor school performance, running late, etc.”</strong><strong> “many participants described their use of TikTok disturbing their sleep, which limited their productivity and performance the following day,” </strong><strong> “[e]very participant indicated that time management on TikTok was especially difficult compared to other social media platforms.”</strong></p></li></ul></li><li><ul><li><p><strong>“feeling like they are trapped in a rabbit hole of what our algorithm thinks they like.”</strong></p></li></ul></li></ul><ul><li><ul><li><p><strong>“Persuasive design strategies exploit the natural human desire to be social and popular, by taking advantage of an individual’s fear of not being social and popular in order to extend their online use. For young people, identity requires constant attention, curation and renewal. At key development stages it can be overwhelmingly important to be accepted by your peer group.”</strong></p></li></ul></li></ul><p><em>[These are the main harms we focused on in The Anxious Generation, although as you can see in the other four clusters, the harms caused by TikTok go far beyond mental health problems.]</em></p><ul><li><p>KY P. 60, PARA 196 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>“offering effects that perpetuate a narrow beauty norm . .. ha[s] the potential to negatively impact the wellbeing of our community.”</strong></p></li></ul></li><li><p>KY P. 65, PARA 213 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><em>[internal TikTok group studying issues affecting TikTok]</em><strong>“compulsive usage correlates with a slew of negative mental health effects like loss of analytical skills, memory formation, contextual thinking, conversational depth, empathy, and increased anxiety.</strong><strong>compulsive usage also interferes with essential personal responsibilities like sufficient sleep, work/school responsibilities, and connecting with loved ones.”</strong></p></li></ul></li><li><p>KY P. 84, PARA 260 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>After following several ‘painhub’ and ‘sadnotes’ accounts, it took me 20 mins to drop into ‘negative’ filter bubble. The intensive density of negative content makes me lower down mood and increase my sadness feelings though I am in a high spirit in my recent life.”</strong><strong>“there are a lot of videos mentioning suicide,” </strong><strong> “If you could kill yourself without hurting anybody would you?”</strong></p></li></ul></li></ul><ul><li><p>KY P. 98, PARA 309-310 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p>309. Defendants know these R1 reviews do not catch a great deal of content that violates the Community Guidelines or restrict content to age-appropriate groups.</p></li><li><p>For example, a presentation about suicide and self-harm content moderation notes that R1 Moderators do not always speak the language shown in the videos, that moderators do not understand context, and that moderators are not given policy reminders for new instructions.</p></li></ul></li></ul><ul><li><p><em>[No direct quotes from TikTok employees, but see pages 36-43 for a section of the brief that describes the videos that were sent to fictitious accounts created by the AG’s office, pretending to be 13, 15, and 17 year old Nebraska residents. “Within minutes of scrolling through TikTok’s “For You” feed—before the accounts had searched for any videos or “followed” any users—TikTok’s algorithm repeatedly exposed each Nebraska teen account to overtly mature and otherwise inappropriate content.” Some of the videos sent to young girls—just on the basis of their age and gender—clearly encouraged young girls to starve themselves.]</em></p></li><li><p><em>Some of the videos also clearly celebrate suicide as the way to escape from psychological pain.</em></p></li></ul><p><em><a href=\"https://www.bbc.com/news/technology-56821882\" rel=\"\">content</a><a href=\"https://findanexpert.unimelb.edu.au/news/72158-tiktok-has-a-startling-amount-of-sexual-content-%E2%80%93-and-it%27s-way-too-easy-for-children-to-access#:~:text=TikTok's%20content%20moderation%20maze,intimate%20imagery%20and%20sexual%20solicitation.\" rel=\"\">accessed</a><a href=\"https://www.house.mn.gov/comm/docs/H_rHCyPfPEyca1P3i1k11g.pdf\" rel=\"\">recommended</a><a href=\"https://www.wired.com/story/tiktok-nsfw/\" rel=\"\">users</a></em></p><ul><li><p>KY P. 38, PARA 115 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>46.5% sexualized and drug content shared by WSJ is not covered by [the existing moderation] policy (ANSA 55%, Drug 24%).”</strong><strong>“[t]he moderation leakage rate of sexualized and drug content is 73.5% (ANSA 58%, Drug 90%).”</strong><strong>“most prevalent policy titles are sexually explicit language and mention of drugs,”</strong><strong>implicit language [e.g., coded language] is often used in videos and failed to be captured [sic] by moderators.”</strong></p></li></ul></li><li><p>KY P. 53, PARA 168 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>“Minors Easily Access Livestream Feed”</strong><strong>“[n]o age-related feed strategy.”</strong><strong>“[o]ne of our key discoveries during this project that has turned into a major challenge with Live business is that the content that gets the highest engagement may not be the content we want on our platform. Transactional sexual content incorporates hundreds of signals that inform the [algorithm] as well as LiveOps metrics of success - # of gifts, frequency of hosts going live, # of comments, etc.”</strong></p></li></ul></li><li><p>KY P.106, PARA 341 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>“Normalization of Pedophilia”</strong><strong>“Minor Sexual Solicitation”</strong><strong>“leading minors off platform”</strong><strong>“Glorification of Minor Sexual Assault”</strong></p></li></ul></li></ul><ul><li><ul><li><p>TikTok also knows that LIVE is being used for money laundering and other criminal activities.</p></li><li><p><em>[TikTok has a virtual currency system where users can “gift” one another].</em></p></li><li><p><strong> “sexually suggestive LIVE content is on the rise,”</strong><strong>“make better use of monetization methods such as gifting and subscription to gain revenue . . . .”</strong></p></li></ul></li><li><ul><li><p>The Division’s presuit investigation also confirmed that TikTok’s platform facilitates the sale of illegal drugs to underage children right here at our doorstep—including easily allowing TikTok users to offer the sale and delivery of drugs like Xanax, Valium, and MDMA to children in Salt Lake City.</p></li></ul></li></ul><ul><li><ul><li><p><strong>“becoming more prevalent”</strong></p></li></ul></li></ul><ul><li><ul><li><p><strong>“the majority didn’t violate guidelines”</strong><strong> “the [TikTok] app doesn’t differentiate between videos it serves to adults and minors.”</strong></p></li></ul></li></ul><ul><li><p><em>[See pages 35-36 and 43-50 for a section of the brief that describes the videos that were sent almost immediately to fictitious accounts created by the AG’s office, pretending to be 13, 15, and 17 year old Nebraska minors. Some of the videos are adult porn actresses engaging in lewd and obscene behavior on TikTok, in order to lure customers over to their Onlyfans pages, sometimes via Instagram.]</em></p></li></ul><ul><li><ul><li><p><strong>“shouldn’t see mature or complex themes, such as: [p]rofanity[, s]exually suggestive content[, r]ealistic violence or threatening imagery[, f]irearms or weapons in an environment that isn’t appropriate[, i]llegal or controlled substances/drugs[, and e]xplicit references to mature or complex themes that may reflect personal experiences or real-world events that are intended for older audiences.” </strong><em>[But they do, as you can see in the leakage rates found in KY P. 106, PARA 341]</em></p></li></ul></li></ul><ul><li><ul><li><p>Federal law mandates that Defendants report suspected CSAM to the National Center for Missing and Exploited Children (“NCMEC”) under 18 U.S.C. § 2258A. To limit and avoid its reporting requirements under federal law, Defendants purposely designed TikTok—which it knows are used by children, including children under 13—not to incorporate modern CSAM detection technology. This technology would be free for Defendants to implement within TikTok’s product design.</p></li><li><p>PARA 113: While Defendants have stepped up their reporting to NCMEC [National Center for Missing &amp; Exploited Children]—reporting 362,108 reports in the last half of 2023—these efforts illustrate how wantonly negligent TikTok has been historically, with only 596 reports made in 2019 and 22,692 in 2020. Defendants’ disregard for the safety of Young Users on TikTok has endangered countless children, including children in Kentucky.</p></li></ul></li><li><p>KY P. 100, PARA 316 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>“[u]sers are more likely to post comments than videos,”</strong><strong>“42% [of users] are ‘comment only’ users[.]”</strong></p></li><li><p><strong>“Comments are increasing and manual coverage is disproportionately low.” </strong><strong>“[h]uman moderation for comment review is at 0.25%.”</strong></p></li></ul></li></ul><ul><li><ul><li><p><strong> “we’ve created an environment that encourages sexual content.”</strong></p></li></ul></li><li><ul><li><p><strong>“enable[d the] exploitation of live hosts”</strong></p></li></ul></li><li><ul><li><p>In response to the Forbes article, TikTok also conducted a formal investigation into issues on LIVE called “Project Meramec.” TikTok shared the results of the investigation internally during a May 2022 “Safety Summit”:</p></li><li><p>PARA 116: Project Meramec confirmed that young users well under the minimum age requirement could host LIVE sessions on TikTok. The study confirmed that in just the month of January 2022 alone, 112,000 “L1” users (i.e., a metric TikTok uses to categorize users between 13 and 15 years old) hosted LIVE sessions.</p></li></ul></li><li><ul><li><ul><li><p><strong>“[H]igher proportion[s] of minor users”;</strong></p></li><li><p><strong>“Minor users are more likely to access high severity risk LIVE content than adult users”;</strong></p></li><li><p><strong>For violating content like “[a]dult nudity and sexual activities (ANSA) . . . and minor-hosted LIVE rooms, minor views are likely 2 times higher than other LIVE rooms”; </strong></p></li><li><p><strong>“Minor users lack self-protection awareness and interact more with risky LIVE content.”</strong></p></li></ul></li></ul></li></ul><ul><li><ul><li><p>In February 2022, two TikTok leaders discussed the need to remove “egregious content from clearly commercial sexual solicitation accounts,” and were aware of issues with women and minors being sexually solicited through LIVE.</p></li><li><p>PARA 112: these leaders knew about agencies that recruited minors to create Child Sexual Abuse Material and commercialized it using LIVE.</p></li><li><p><strong>“streamer-led sexual engagements (often transactional) [were] commonly associated with TikTok LIVE.”</strong><strong>“often seeing cam-girls or prostitutes asking viewers for tips/donations to take off their clothes or write their names on their body . . . .”</strong><strong>“good amount of minors engaging in it.” </strong><strong> “a lot of nudity and soft porn.” </strong></p></li><li><p><strong> “perpetrators tend to use tactics such as gift giving, flattery, and gifting money to win the trust of minors.”</strong></p></li></ul></li><li><ul><li><p>In September 2022—five months after the Forbes story—an investigator found that “within minutes of browsing the [LIVE] feed” they were shown underage girls providing sexually suggestive content in exchange for money and young boys using filters to pose as girls to receive Gifts.</p></li><li><p>PARA 126: The investigator also found a “never-ending stream” of hosts who openly admitted that they were 14 and 15 years old while also “holding signs” or “standing in front of the camera” with a sign saying “Rose = say daddy,” “ice cream = 360 spin,” or “universe = cut shirt.”</p></li></ul></li></ul><p><em><a href=\"https://support.tiktok.com/en/live-gifts-wallet/tiktok-live/what-is-tiktok-live\" rel=\"\">TikTok LIVE</a><a href=\"https://docs.house.gov/meetings/IF/IF00/20230323/115519/HHRG-118-IF00-Wstate-ChewS-20230323.pdf\" rel=\"\">regularly</a></em></p><ul><li><p>KY P. 93, PARA 288 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>“goal is not to reduce the time spent”</strong><strong>“contribute to DAU [daily active users] and retention” </strong></p></li></ul></li><li><p>KY P. 93, PARA 289 [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>“we don’t expect significant impact to stay time with this feature since it is only improving awareness and is not an intervention.”</strong></p></li><li><p><strong>“minors do not have executive function to control their screen time.”</strong></p></li></ul></li></ul><ul><li><p>KY P. 95, PARA 297, [REDACTED BUT RETRIEVABLE TEXT]</p><ul><li><p><strong>“provide users with educational resources about image disorders; create a campaign “to raise awareness on issues with low self esteem (caused by the excessive filter use and other issues)”; and add “a banner/H5 page to these filters and/or short videos which make use of the filters, particularly the Bold Glamour one, including an awareness statement about filters and the importance of positive body image/mental health, [that] could potentially minimize the negative public perception surrounding beauty filters and their reported effect on user mental health.”</strong></p></li></ul></li></ul><ul><li><ul><li><p>PARA 123: But raising the minimum age from 16 to 18 did nothing to solve the problem. TikTok’s age-gating is ineffective, and many kids still join LIVE events daily. TikTok also chose to forgo reasonable safety measures, prioritizing profits over safety, allowing unrestrained transactional sexual content and other illicit activities to thrive.</p></li><li><p><strong>‘teens in overtly sexualized situations on live streams controlled by someone older than 18 who is collecting money from viewers while the teen performs sexually suggestive acts.’</strong></p></li></ul></li><li><ul><li><p><strong> “Minors are more curious and prone to ignore warnings”</strong><strong>“Without meaningful age verification methods, minors would typically just lie about their age.”</strong></p></li></ul></li><li><ul><li><p><strong>“such a huge part of the strategy for the [TikTok app]”</strong><strong> “reasonably expect to increase limitations for LIVE” </strong><strong> “it is irresponsible [of TikTok] to expect that users will use LIVE wisely.”</strong></p></li><li><p>PARA 120: In other words, LIVE was too profitable to be interfered with, even to protect children.</p></li></ul></li><li><ul><li><p>These policies do not adequately safeguard children and, furthermore, are not consistently applied. In 2020, TikTok unveiled an ‘internal program’ to ‘protect creators and other accounts that [TikTok] deem to be high value.’ The program featured policy shortcuts like ‘delayed enforcement,’ ‘deferred policy decisions,’ or ‘no permanent ban on Elite + Accounts,’ to protect its popular users who violate TikTok’s policies. TikTok deployed this look-the-other-way policy despite knowing that the ‘majority of elite accounts appear to run afoul of [TikTok’s] policies on sexually explicit content,’ among other violations. Approximately 1,400 minors were considered ‘elite creators.’</p></li></ul></li></ul><ul><li><ul><li><p><strong>“a lot of the users, especially top users, are under 13,”</strong><strong> “those kids will anyway say they are over 13.”</strong></p></li></ul></li><li><ul><li><p><strong>“[f]amilies do not use Family Pairing”</strong><strong> “Family Pairing doesn’t address parents’ top concerns,”</strong><strong>“inappropriate content, offensive interactions, and lack of privacy.</strong></p></li></ul></li><li><ul><li><p><strong>“we don’t want to [make changes] to the For You feed because it’s going to decrease engagement,” </strong><strong>“it could actually help people with screen time management.”</strong></p></li></ul></li><li><ul><li><p><strong>“[w]hen we make changes, we make sure core metrics aren’t affected.”</strong><strong>“[l]eaders don’t buy into problems” </strong><strong> “not a priority for any other team.”</strong></p></li></ul></li><li><ul><li><p><strong>“[w]e found out through some research that they’re not altogether effective”</strong><strong> “it’s good as a point to share with policymakers, ‘cause they’re kind of impressed that we’re spending time, money, and energy to get people off our platform, at least in theory.”</strong></p></li></ul></li><li><ul><li><p><strong>“not . . . at expense of retention.”</strong><strong>not to reduce the time spent” </strong><strong>“improve user experience and satisfaction”</strong><strong>contribute to DAU [Daily Active Users] and retention.” </strong><strong>“[t]his aligns with leadership’s guidance” </strong><strong>“no impact to retention.”</strong></p></li></ul></li></ul><p><em>I’ve tried to quit but I just can’t do it,</em><em>I can’t quit because then I won’t know what everyone else is talking about</em><a href=\"https://mashable.com/article/common-sense-media-teenagers-social-media\" rel=\"\">trapped</a><a href=\"https://www.instagram.com/jonathanhaidt/reel/DB167XHvRLh/\" rel=\"\">Kori James said</a></p><p><a href=\"https://bfi.uchicago.edu/insight/research-summary/when-product-markets-become-collective-traps-the-case-of-social-media/\" rel=\"\">recent study</a><em>most students were willing to pay to have that happen</em></p><p><a href=\"https://theharrispoll.com/briefs/gen-z-social-media-smart-phones/\" rel=\"\">conducted a nationally representative survey</a></p><p>What, then, is the net value of TikTok to society? The harms are vast and varied, and they are hitting children, teens, and young adults the hardest, which means that TikTok may be altering developmental pathways and causing lasting changes. The net value is likely very negative. We believe that America would be much better off if TikTok were to go dark on January 19th.</p>","contentLength":20553,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43716665"},{"title":"An intro to DeepSeek's distributed file system","url":"https://maknee.github.io/blog/2025/3FS-Performance-Journal-1/","date":1744894237,"author":"sebg","guid":226,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43716058"},{"title":"Which year: guess which year each photo was taken","url":"https://whichyr.com/","date":1744886526,"author":"trymas","guid":225,"unread":true,"content":"<p>The closer your guess is to the actual year, the more points you'll score. Perfect guesses earn maximum points!</p>","contentLength":111,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43715024"},{"title":"Zoom outage caused by accidental 'shutting down' of the zoom.us domain","url":"https://status.zoom.us/incidents/pw9r9vnq5rvk","date":1744851349,"author":"RVRX","guid":224,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43711957"},{"title":"Man who built ISP instead of paying Comcast expands to hundreds of homes (2022)","url":"https://arstechnica.com/tech-policy/2022/08/man-who-built-isp-instead-of-paying-comcast-50k-expands-to-hundreds-of-homes/","date":1744834010,"author":"voxadam","guid":223,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43709770"},{"title":"OpenAI Codex CLI: Lightweight coding agent that runs in your terminal","url":"https://github.com/openai/codex","date":1744824290,"author":"mfiguiere","guid":222,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43708025"},{"title":"OpenAI o3 and o4-mini","url":"https://openai.com/index/introducing-o3-and-o4-mini/","date":1744822914,"author":"maheshrijal","guid":221,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43707719"},{"title":"Darwin's children drew all over the “On the Origin of Species” manuscript (2014)","url":"https://theappendix.net/posts/2014/02/darwins-children-drew-vegetable-battles-on-the-origin-of-species","date":1744813716,"author":"arbesman","guid":220,"unread":true,"content":"<p>Yesterday was Darwin Day, marking the 205th anniversary of the great naturalist’s birth on February 12, 1809. One of the great things about Darwin is that a huge amount of his work is digitized and freely available via sites like <a href=\"http://darwin-online.org.uk/\">Darwin Online</a>.</p><p>Interested browsers can also check out the <a href=\"http://darwin.amnh.org/browse.php?mode=uc&amp;id=72001\">Darwin Manuscripts Project</a>, a collaborative initiative based at the American Museum of Natural History. Here you can read through Darwin’s personal notes, including gems like his <a href=\"http://darwin.amnh.org/viewer.php?eid=15156&amp;mode=clean\">scratched out book title ideas</a>. There are also a number of nature drawings that Darwin prepared while writing his masterpiece, <em>On the Origin of Species by Means of Natural Selection</em> (1859). Here, for example, is Darwin’s rather skillful drawing of the stamen of a  flower:</p><div><a href=\"https://theappendix.net/images/blog/2014/02/76763_-large.jpg\"><img src=\"https://theappendix.net/images/blog/2014/02/76763_-medium.jpg\" width=\"640\" alt=\"puck\"></a></div><p>But there are other drawings in Darwin’s papers that defy explanation - until we remember that Darwin and his wife Emma (who, famously, was also his cousin) had a huge family of ten children. Scholars believe that a young Francis Darwin, the naturalist’s third oldest son, drew this on the back of Darwin’s manuscript for .</p><div><a href=\"https://theappendix.net/images/blog/2014/02/DArwin1-large.jpg\"><img src=\"https://theappendix.net/images/blog/2014/02/DArwin1-medium.jpg\" width=\"640\" alt=\"puck\"></a><p>\n    “The Battle of the Fruit and Vegetable Soldiers”\n    </p></div><p>Remarkably, this is one of only twenty-eight pages of the manuscript that still exist. The Cambridge University Library has given it the descriptive name “The Battle of the Fruit and Vegetable Soldiers,” and so indeed it seems to be. As near as I can make out, it shows a turbaned soldier mounted on a blueberry squaring off with an English dragoon on a carrot-steed. Perhaps inspired by the 1839-1842 Anglo-Afghan War, and filtered through the Darwin household’s fascination with plants and gardening?</p><p>Here’s another drawing from the talented Darwin children, this one seemingly directly inspired by their father’s work. Birds are in the act of catching a spider and a gnat or bee, while flowers and a butterfly appear in remarkable detail. Clearly the family had a knack for acute observations of nature (in fact young Francis ended up becoming a naturalist as well).</p><div><a href=\"https://theappendix.net/images/blog/2014/02/Darwin2-large.jpg\"><img src=\"https://theappendix.net/images/blog/2014/02/Darwin2-medium.jpg\" width=\"640\" alt=\"puck\"></a></div><p>This one’s my personal favorite: a child’s-eye view of the Darwin family home with cozy details like a tea kettle on the boil and a fluffy orange cat in the attic window.</p><div><a href=\"https://theappendix.net/images/blog/2014/02/BXMEXhRCcAAgp-N-large.jpg\"><img src=\"https://theappendix.net/images/blog/2014/02/BXMEXhRCcAAgp-N-medium.jpg\" width=\"640\" alt=\"puck\"></a></div><p>Fascinatingly, this image might be detailed enough that it actually depicts Darwin’s famous <a href=\"http://darwin-online.org.uk/content/frameset?viewtype=text&amp;itemID=F1452.1&amp;pageseq=132\">sandwalk</a>, his “thinking path” that led to the family greenhouse (which is, perhaps, the structure visible at the end of the path). The area was later made into a playground for the Darwin children.</p><p>I poked around the items available at Darwin Online and came across <a href=\"http://darwin-online.org.uk/EmmaDiaries.html\">Emma Darwin’s diaries</a>, which are a fascinating resource. Emma seems to have been a talented sketch artist in her own right, doodling profiles and faces in over her daily schedule:</p><div><a href=\"https://theappendix.net/images/blog/2014/02/Darwin3a_1824-large.jpg\"><img src=\"https://theappendix.net/images/blog/2014/02/Darwin3a_1824-medium.jpg\" width=\"640\" alt=\"puck\"></a></div><p>Here’s another, perhaps a self-portrait? Write us on <a href=\"https://twitter.com/appendixjournal\">Twitter</a> or <a href=\"https://www.facebook.com/TheAppendix\">Facebook</a> if you have any ideas as to whether this is Emma’s self-portrait or a drawing of another family member.</p><div><a href=\"https://theappendix.net/images/blog/2014/02/Darwin3-large.jpg\"><img src=\"https://theappendix.net/images/blog/2014/02/Darwin3-medium.jpg\" width=\"640\" alt=\"puck\"></a></div><p>Amazingly, the Darwin kids even got into Emma’s diary, with several pages rendered unreadable by what is almost certainly a crazed toddler’s pencil. In fact, the back page of Emma’s potential self-portrait was defaced in precisely this way:</p><div><a href=\"https://theappendix.net/images/blog/2014/02/Darwin3b-large.jpg\"><img src=\"https://theappendix.net/images/blog/2014/02/Darwin3b-medium.jpg\" width=\"640\" alt=\"puck\"></a><p>\n    Francis Darwin strikes again?\n    </p></div><p>It’s all a great reminder that even legendary scientists had family lives, and that when we think about history, it’s important to remember that famous figures weren’t working in isolation. They were surrounded by far less famous friends, family members, acquaintances, and enemies. And sometimes, when we get lucky, we see some of their artifacts from the past too.</p><p>A tip of the hat, by the way, to <a href=\"http://www.openculture.com/\">Open Culture</a>, a website that we’re avid fans of and which wrote the original post about the Darwin kids’ drawings that brought them to our attention. Also be sure to check out <a href=\"http://darwin-online.org.uk/\">Darwin Online</a> and the <a href=\"http://darwin.amnh.org/\">Darwin Manuscripts Project</a>, two wonderful resources for anyone interested in the naturalist and his times.</p><p>I also wanted to include a short note on Annie Darwin, who died from tuberculosis at age ten and was Charles’ favorite child (or so he <a href=\"https://books.google.com/books?id=6ikIAQAAMAAJ&amp;q=%22the+apple+of+her+proud+father%27s+eye,+his+favourite+child,%22&amp;dq=%22the+apple+of+her+proud+father%27s+eye,+his+favourite+child,%22&amp;hl=en&amp;sa=X&amp;ei=ewj9Uu3tLqbQ2wXYjoDICg&amp;ved=0CC0Q6AEwAQ\">told</a> his cousin). This box of items relating to Annie’s life that was collected by Emma Darwin offers another, sadder testimony to the tight-knit dynamic of the Darwin family, and to their artistic knack. Annie’s pink flowers in careful needlepoint seem to echo the exuberant nature drawings of her siblings:</p><div><a href=\"https://theappendix.net/images/blog/2014/02/darwin4-large.jpg\"><img src=\"https://theappendix.net/images/blog/2014/02/darwin4-medium.jpg\" width=\"640\" alt=\"puck\"></a><p>\n    The Darwins’ box of mementos relating to Annie’s life.\n    </p></div><p>Darwin wrote about Annie after her death with touching earnestness as he tried to set down his memories of her before they faded:</p><blockquote><p>Our poor child, Annie, was born in Gower St on March 2d. 1841. &amp; expired at Malvern at1 Midday on the 23d. of April 1851.— I write these few pages, as I think in after years, if we live, the impressions now put down will recall more vividly her chief characteristics. From whatever point I look back at her, the main feature in her disposition which at once rises before me is her buoyant joyousness.</p></blockquote><div><a href=\"https://theappendix.net/images/blog/2014/02/darwin5-large.jpg\"><img src=\"https://theappendix.net/images/blog/2014/02/darwin5-medium.jpg\" width=\"640\" alt=\"puck\"></a><p>\n    Darwin’s memoir of Annie in his personal papers.\n    </p></div><p>In his book <em>Annie’s Box: Charles Darwin, His Daughter And Human Evolution,</em> Randal Keynes argues that Darwin’s scientific thought was closely entangled with his family life, and that the death of Annie just before Easter in 1851 spelled the end of Darwin’s already weakening Christian faith. Students of the past are often leery of making overly explicit and binary links between work and life (I remember being amazed when I learned that Shakespeare’s son Hamnet died several years before he wrote  and that literary scholars don’t make more hay with that fact). But if nothing else, it again reminds us that when historical figures become legendary icons, they lose much of the context that makes them human to us at the remove of decades or centuries.</p>","contentLength":5780,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43706037"},{"title":"CVE program faces swift end after DHS fails to renew contract [updated]","url":"https://www.csoonline.com/article/3963190/cve-program-faces-swift-end-after-dhs-fails-to-renew-contract-leaving-security-flaw-tracking-in-limbo.html","date":1744768647,"author":"healsdata","guid":219,"unread":true,"content":"<p>“First, the federated model and CVE Numbering Authorities (CNA) can no longer assign IDs and send info to MITRE for quick publication. Second, all of that is the foundation for the National Vulnerability Database (NVD), which is already beyond struggling, with a backlog of over 30,000 vulnerabilities and the recent announcement of over 80,000 ‘deferred’ (meaning will not be fully analyzed by their current standards).”</p><p>Martin added, “Third, every company that maintains ‘their own vulnerability database’ that is essentially lipstick on the CVE pig will have to find alternate sources of intelligence. Fourth, national vulnerability databases like China’s and Russia’s, among others, will largely dry up (Russia more than China). Fourth [sic], hundreds, if not thousands, of National / Regional CERTs around the world, no longer have that source of free vulnerability intelligence. Fifth [sic], every company in the world that relied on CVE/NVD for vulnerability intelligence is going to experience swift and sharp pains to their vulnerability management program.”</p><h2>Why is the contract ending?</h2><p>It’s unclear what led to DHS’s decision to end the contract after 25 years of funding <a href=\"https://cyberscoop.com/cve-program-history-mitre-nist-1999-2024/\">the highly regarded</a> program. The Trump administration, primarily through Elon Musk’s Department of Government Efficiency initiative, has been slashing government spending across the board, particularly at the Cybersecurity and Infrastructure Security Agency (CISA), through which DHS funds the MITRE CVE program.</p>","contentLength":1517,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43700607"},{"title":"TLS certificate lifetimes will officially reduce to 47 days","url":"https://www.digicert.com/blog/tls-certificate-lifetimes-will-officially-reduce-to-47-days","date":1744729762,"author":"crtasm","guid":218,"unread":true,"content":"<p>47 days might seem like an arbitrary number, but it’s a simple cascade:</p><ul><li>200 days = 6 maximal month (184 days) + 1/2 30-day month (15 days) + 1 day wiggle room</li><li>100 days = 3 maximal month (92 days) + ~1/4 30-day month (7 days) + 1 day wiggle room</li><li>47 days = 1 maximal month (31 days) + 1/2 30-day month (15 days) + 1 day wiggle room</li></ul><h4></h4><p>In the ballot, Apple makes many arguments in favor of the moves, one of which is most worth calling out. They state that the CA/B Forum has been telling the world for years, by steadily shortening maximum lifetimes, that automation is essentially mandatory for effective <a href=\"https://www.digicert.com/tls-ssl/certcentral-tls-ssl-manager\">certificate lifecycle</a> management.</p><p>The ballot argues that shorter lifetimes are necessary for many reasons, the most prominent being this: The information in certificates is becoming steadily less trustworthy over time, a problem that can only be mitigated by frequently revalidating the information.</p><p>The ballot also argues that the revocation system using CRLs and OCSP is unreliable. Indeed, browsers often ignore these features. The ballot has a long section on the failings of the certificate revocation system. Shorter lifetimes mitigate the effects of using potentially revoked certificates. In 2023, CA/B Forum took this philosophy to another level by approving short-lived certificates, which expire within 7 days, and which do not require CRL or OCSP support.</p><h4></h4><p>Two points about the new rules are likely to cause confusion:</p><ol><li>The three years for the rule changes are 2026, 2027, and 2029, but the gap between the second set of years is two years long.</li><li>As of March 15, 2029, the maximum lifetime for a TLS certificate will be 47 days, but the maximum period during which domain validation information may be reused is . Manual revalidation will still technically be possible, but doing so would be a recipe for failure and outages.</li></ol><p>As a certificate authority, one of the most common questions we hear from customers is whether they’ll be charged more to replace certificates more frequently. The answer is no. Cost is based on an annual subscription, and what we’ve learned is that, once users <a href=\"https://www.digicert.com/trust-lifecycle-manager\">adopt automation</a>, they often voluntarily move to more rapid certificate replacement cycles.</p><p>For this reason, and because even the 2027 changes to 100-day certificates will make manual procedures untenable, we expect rapid adoption of automation long before the 2029 changes.</p><p>Apple’s statement about automated certificate lifecycle management is indisputable, but it’s something we’ve been long preparing for. DigiCert offers multiple automation solutions through&nbsp;<a href=\"https://www.digicert.com/trust-lifecycle-manager\">Trust Lifecycle Manager</a>&nbsp;and&nbsp;<a href=\"https://www.digicert.com/tls-ssl/certcentral-tls-ssl-manager\">CertCentral</a>, including support for ACME.&nbsp;DigiCert’s ACME allows automation of DV, OV, and EV certificates and includes support for ACME Renewal Information (ARI).</p><p><a href=\"https://www.digicert.com/contact-us\">Get in touch</a> for more information on how you can make the best use of automation.</p><h4></h4>","contentLength":2838,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43693900"},{"title":"How to win an argument with a toddler","url":"https://seths.blog/2025/04/how-to-win-an-argument-with-a-toddler/","date":1744727905,"author":"herbertl","guid":217,"unread":true,"content":"<p>That’s because toddlers don’t understand what an argument is and aren’t interesting in having one.</p><p>Toddlers (which includes defensive bureaucrats, bullies, flat earthers, folks committed to a specific agenda and radio talk show hosts) may indicate that they’d like to have an <a href=\"https://youtu.be/ohDB5gbtaEQ?si=AvfXoVSSSAzU04WW\">argument</a>, but they’re actually engaging in connection, noise, play acting or a chance to earn status. It can be fun to be in opposition, to harangue or even to use power to change someone’s position.</p><p>An argument, though, is an exchange of ideas that ought to surface insight and lead to a conclusion.</p><p>If you’re regularly having arguments with well-informed people of goodwill, you will probably ‘lose’ half of them–changing your mind based on what you’ve learned. <em>If you’re not changing your mind, it’s likely you’re not actually having an argument</em> (or you’re hanging out with the wrong people.) While it can be fun to change someone else’s position, it’s also a gift to learn enough to change ours.</p><p>The toddler puts on a show of having an argument, but they are holding a tantrum in reserve. If they ‘win’ the argument, no tantrum is needed. If they lose, they can tell themselves that they tried but the other person deserved the tantrum because they didn’t listen.</p><p>“Tell me about other strongly-held positions you’ve changed as the result of a discussion like this one…” is a direct way to start a conversation about the argument you’re proposing to have. “What sort of information would make it likely you could see this in a different way?”</p><p>It probably doesn’t pay to argue over things we have chosen to believe as part of our identity.</p>","contentLength":1667,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43693402"},{"title":"America underestimates the difficulty of bringing manufacturing back","url":"https://www.molsonhart.com/blog/america-underestimates-the-difficulty-of-bringing-manufacturing-back","date":1744725049,"author":"putzdown","guid":216,"unread":true,"content":"","contentLength":0,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43692677"},{"title":"How the U.S. became a science superpower","url":"https://steveblank.com/2025/04/15/how-the-u-s-became-a-science-superpower/","date":1744723479,"author":"groseje","guid":215,"unread":true,"content":"<p>Prior to WWII the U.S was a distant second in science and engineering. By the time the war was over, U.S. science and engineering had blown past the British, and led the world for 85 years.</p><p>It happened because two very different people were the science advisors to their nation’s leaders. Each had radically different views on how to use their country’s resources to build advanced weapon systems. Post war, it meant Britain’s early lead was ephemeral while the U.S. built the foundation for a science and technology innovation ecosystem that led the world – until now.</p><p><strong>The British – Military Weapons Labs</strong>When Winston Churchill became the British prime minister in 1940, he had at his side his science advisor, Professor Frederick Lindemann, his friend for 20 years. Lindemann headed up the physics department at Oxford and was the director of the Oxford <a href=\"https://en.wikipedia.org/wiki/Clarendon_Laboratory\">Clarendon Laboratory</a>. Already at war with Germany, Britain’s wartime priorities focused on defense and intelligence technology projects, e.g. weapons that used electronics, radar, physics, etc. – a <a href=\"https://en.wikipedia.org/wiki/Chain_Home\">radar-based air defense network</a> called Chain Home, <a href=\"https://en.wikipedia.org/wiki/AI_Mark_VIII_radar\">airborne radar on night fighters</a>, and plans for a nuclear weapons program – the <a href=\"https://en.wikipedia.org/wiki/MAUD_Committee\">MAUD Committee</a> which started the British nuclear weapons program code-named <a href=\"https://en.wikipedia.org/wiki/Tube_Alloys\">Tube Alloys</a>. And their codebreaking organization at Bletchley Park was starting to read secret German messages – the Enigma – using the <a href=\"https://en.wikipedia.org/wiki/Colossus_computer\">earliest computers</a> ever built.</p><p>As early as the mid 1930s, the British, fearing Nazi Germany, developed prototypes of these weapons using their existing military and government research labs. The <a href=\"https://en.wikipedia.org/wiki/Telecommunications_Research_Establishment\">Telecommunications Research Establishment</a> built early-warning Radar, critical to Britain’s survival during the <a href=\"https://en.wikipedia.org/wiki/Battle_of_Britain\">Battle of Britain</a>, and electronic warfare to protect British bombers over Germany. The <a href=\"https://en.wikipedia.org/wiki/Admiralty_Research_Laboratory\">Admiralty Research Lab</a> built Sonar and anti-submarine warfare systems. The Royal Aircraft Establishment was developing <a href=\"https://en.wikipedia.org/wiki/Gloster_Meteor\">jet fighters</a>. The labs then contracted with British companies to manufacture the weapons in volume. British government labs viewed their universities as a source of talent, but they had no role in weapons development.</p><p>Under Churchill, Professor Lindemann influenced which projects received funding and which were sidelined. Lindemann’s WWI experience as a researcher and test pilot on the staff of the&nbsp;<a href=\"https://en.wikipedia.org/wiki/Royal_Aircraft_Factory\">Royal Aircraft Factory</a>&nbsp;at&nbsp;<a href=\"https://en.wikipedia.org/wiki/Farnborough,_Hampshire\">Farnborough</a> gave him confidence in the competence of British military research and development labs. His <em>top-down, centralized approach</em>primarily<em> in government research labs</em> shaped British innovation during WW II – and led to its demise post-war.</p><p><strong>The Americans – University Weapons Labs</strong>Unlike Britain, the U.S. lacked a science advisor. It wasn’t until June 1940, that Vannevar Bush, ex-MIT dean of engineering, told President Franklin Roosevelt that World War II would be the first war won or lost on the basis of advanced technology electronics, radar, physics problems, etc.</p><p><a href=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Bush-on-Time-Cover.jpg?ssl=1\"><img data-recalc-dims=\"1\" decoding=\"async\" data-attachment-id=\"32254\" data-permalink=\"https://steveblank.com/2025/04/15/how-the-u-s-became-a-science-superpower/bush-on-time-cover/\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Bush-on-Time-Cover.jpg?fit=337%2C447&amp;ssl=1\" data-orig-size=\"337,447\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;1&quot;}\" data-image-title=\"Bush on Time Cover\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Bush-on-Time-Cover.jpg?fit=226%2C300&amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Bush-on-Time-Cover.jpg?fit=337%2C447&amp;ssl=1\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Bush-on-Time-Cover.jpg?resize=259%2C343&amp;ssl=1\" alt=\"\" width=\"259\" height=\"343\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Bush-on-Time-Cover.jpg?w=337&amp;ssl=1 337w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Bush-on-Time-Cover.jpg?resize=226%2C300&amp;ssl=1 226w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Bush-on-Time-Cover.jpg?resize=113%2C150&amp;ssl=1 113w\" sizes=\"(max-width: 259px) 100vw, 259px\"></a>Unlike Lindemann, Bush had a 20-year-long contentious history with the U.S. Navy and a dim view of government-led R&amp;D. Bush contended that the government research labs were slow and second rate. He convinced the President that while the Army and Navy ought to be in charge of making conventional weapons – planes, ships, tanks, etc. — scientists from academia could develop better&nbsp;advanced technology weapons and deliver them faster than Army and Navy research labs. And he argued the only way the scientists could be productive was if they worked in a university setting in  weapons labs run by university professors. To the surprise of the Army and Navy Service chiefs, Roosevelt agreed to let Bush build exactly that organization to coordinate and fund all advanced weapons .</p><p>(While Bush had no prior relationship with the President, Roosevelt had been the Assistant Secretary of the Navy during World War I and like Bush had seen first-hand its dysfunction. Over the next four years they worked well together. Unlike Churchill, Roosevelt had little interest in science and accepted Bush’s opinions on the direction of U.S. technology programs, giving Bush sweeping authority.)</p><p>In 1941, Bush upped the game by convincing the President that in addition to research, <em>development, acquisition and deployment of these weapons also ought to be done by professors in universities</em>. There they would be tasked to <a href=\"http://www.amazon.com/Scientists-against-James-Phinney-Baxter/dp/0262520125/\">develop military weapons systems and solve military problems</a> to defeat Germany and Japan. (The weapons were then manufactured in volume by U.S. corporations Western Electric, GE, RCA, Dupont, Monsanto, Kodak, Zenith, Westinghouse, Remington Rand and Sylvania.) To do this Bush created the&nbsp;Office of Scientific Research and Development (OSR&amp;D).</p><p><a href=\"http://www.archives.gov/research/guide-fed-records/groups/227.html#227.1\">OSR&amp;D</a> headquarters divided the wartime work into 19 “divisions,” 5 “committees,” and 2 “panels,” each solving a unique part of the military war effort. There were no formal requirements.</p><p><a href=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?ssl=1\"><img data-recalc-dims=\"1\" decoding=\"async\" data-attachment-id=\"32153\" data-permalink=\"https://steveblank.com/?attachment_id=32153\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?fit=1260%2C1135&amp;ssl=1\" data-orig-size=\"1260,1135\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Office of Science Research and Development\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?fit=300%2C270&amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?fit=468%2C421&amp;ssl=1\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?resize=468%2C421&amp;ssl=1\" alt=\"\" width=\"468\" height=\"421\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?resize=1024%2C922&amp;ssl=1 1024w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?resize=300%2C270&amp;ssl=1 300w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?resize=150%2C135&amp;ssl=1 150w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?resize=768%2C692&amp;ssl=1 768w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?w=1260&amp;ssl=1 1260w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Office-of-Science-Research-and-Development.jpg?w=936&amp;ssl=1 936w\" sizes=\"(max-width: 468px) 100vw, 468px\"></a>Staff at OSRD worked with their military liaisons to understand what the most important military problems were and then each OSR&amp;D division came up with solutions. These efforts spanned an enormous range of tasks – the development of advanced electronics, radar, <a href=\"http://calteches.library.caltech.edu/3672/1/Snyder.pdf\">rockets</a>, <a href=\"https://dosits.org/people-and-sound/history-of-underwater-acoustics/world-war-ii-1941-1945/\">sonar</a>, new weapons like the <a href=\"https://en.wikipedia.org/wiki/Proximity_fuze#:~:text=Work%20on%20the%20radio%20shell,innovations%20of%20World%20War%20II.\">proximity fuse</a>, <a href=\"http://www.globalsecurity.org/military/systems/munitions/napalm.htm\">Napalm</a>, the Bazooka and new drugs such as <a href=\"http://www.lib.niu.edu/2001/iht810139.html\">penicillin</a>, cures for malaria, chemical warfare, and <a href=\"https://steveblank.com/2023/08/29/before-there-was-oppenheimer-there-was-vannevar-bush/\">nuclear weapons</a>.</p><p>Each&nbsp; division was run by a professor hand-picked by Bush. And they were located in universities –&nbsp; MIT, Harvard, Johns Hopkins, Caltech, Columbia and the University of Chicago all ran major weapons systems programs. Nearly 10,000 scientists and engineers, professors and their grad students received draft deferments to work in these university labs.</p><p><strong>Americans – Unlimited Dollars</strong>What changed U.S. universities, and the world forever, was government money. Lots of it. Prior to WWII most advanced technology research in the U.S. was done in corporate innovation labs (GE, AT&amp;T, Dupont, RCA, Westinghouse, NCR, Monsanto, Kodak, IBM, et al.) Universities had no government funding (<a href=\"https://www.congress.gov/crs-product/R45897\" target=\"_blank\" rel=\"noopener\">except for agriculture</a>) for research. Academic research had been funded by non-profits, mostly the Rockefeller and Carnegie foundations and industry. Now, for the first time, U.S. universities were getting more money than they had ever seen. Between 1941 and 1945, OSR&amp;D gave $9 billion (in 2025 dollars) to the top U.S. research universities. This made universities full partners in wartime research, not just talent pools for government projects as was the case in Britain.</p><p><strong>The British – Wartime Constraints</strong>Wartime Britain had very different constraints. First, England was under daily attack.<a href=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?ssl=1\"><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"32262\" data-permalink=\"https://steveblank.com/2025/04/15/how-the-u-s-became-a-science-superpower/blitz-aftermath/\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?fit=1920%2C1499&amp;ssl=1\" data-orig-size=\"1920,1499\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"Blitz aftermath\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?fit=300%2C234&amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?fit=468%2C365&amp;ssl=1\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?resize=252%2C197&amp;ssl=1\" alt=\"\" width=\"252\" height=\"197\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?resize=300%2C234&amp;ssl=1 300w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?resize=1024%2C799&amp;ssl=1 1024w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?resize=150%2C117&amp;ssl=1 150w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?resize=768%2C600&amp;ssl=1 768w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?resize=1536%2C1199&amp;ssl=1 1536w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?w=1920&amp;ssl=1 1920w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?w=936&amp;ssl=1 936w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/Blitz-aftermath.jpg?w=1404&amp;ssl=1 1404w\" sizes=\"auto, (max-width: 252px) 100vw, 252px\"></a> They were being bombed by air and blockaded by submarines, so it was logical that they <a href=\"https://www.youtube.com/watch?v=C6uV-BojTw4\">focused on a smaller set of high-priority projects</a> to counter these threats. Second, the country was teetering on bankruptcy. It couldn’t afford the broad and deep investments that the U.S. made. (Illustrated by their abandonment of their nuclear weapons programs when they realized how much it would cost to turn the research into industrial scale engineering.) This meant that many other areas of innovation—such as early computing and nuclear research—were underfunded compared to their American counterparts.</p><p>Churchill was voted out of office in 1945. With him went Professor Lindemann and the coordination of British science and engineering. Britain would be without a science advisor until 1951-55 when Churchill returned for a second term and brought back Lindemann with him.</p><p>The end of the war led to extreme downsizing of the British military including severe cuts to all the government labs that had developed Radar, electronics, computing, etc.</p><p>With post-war Britain financially exhausted, post-war austerity limited its ability to invest in large-scale innovation. There were no post-war plans for government follow-on investments. The differing economic realities of the U.S. and Britain also played a key role in shaping their innovation systems. The United States had an enormous industrial base, abundant capital, and a large domestic market, which enabled large-scale investment in research and development. In Britain, a socialist government came to power. Churchill’s successor, Labor’s Clement Attlee, dissolved the British empire, nationalized banking, power and light, transport, and iron and steel, all which reduced competition and slowed technological progress.</p><p>While British research institutions like Cambridge and Oxford remained leaders in theoretical science, they struggled to scale and commercialize their breakthroughs. For instance Alan Turing’s and Tommy Flower’s pioneering work on <a href=\"https://www.tnmoc.org/colossus\" target=\"_blank\" rel=\"noopener\">computing at Bletchley Park</a> didn’t turn into a thriving British computing industry—unlike in the U.S., where companies like ERA, Univac, NCR and IBM built on their wartime work.</p><p>Without the same level of government support for dual-use technologies or commercialization, and with private capital absent for new businesses, Britain’s post-war innovation ecosystem never took off.</p><p>Meanwhile in the U.S. universities and companies realized that the wartime government funding for research had been an amazing accelerator for science, engineering, and medicine. Everyone, including Congress, agreed that the U.S. government should continue to play a large role in continuing it. In 1945, Vannevar Bush published a report “<a href=\"https://nsf-gov-resources.nsf.gov/2023-04/EndlessFrontier75th_w.pdf\">Science, The Endless Frontier</a>” advocating for government funding of basic research in universities, colleges, and research institutes. Congress argued on how to best organize federal support of science.</p><p>By the end of the war, OSR&amp;D funding had taken technologies that had been just research papers or considered impossible to build at scale and made them commercially viable – computers, rockets, radar, Teflon, synthetic fibers, nuclear power, etc. Innovation clusters formed around universities like MIT and Harvard which had received large amounts of OSR&amp;D funding (<a href=\"https://en.wikipedia.org/wiki/MIT_Radiation_Laboratory\">MIT’s Radiation Lab or “Rad Lab”</a> employed 3,500 civilians during WWII and developed and built 100 radar systems deployed in theater,) or around professors who ran one of the OSR&amp;D divisions – like <a href=\"https://steveblank.com/2009/04/27/the-secret-history-of-silicon-valley-part-vi-the-secret-life-of-fred-terman-and-stanford/\">Fred Terman at Stanford</a>.</p><p><a href=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?ssl=1\"><img data-recalc-dims=\"1\" loading=\"lazy\" decoding=\"async\" data-attachment-id=\"32155\" data-permalink=\"https://steveblank.com/?attachment_id=32155\" data-orig-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?fit=1447%2C1072&amp;ssl=1\" data-orig-size=\"1447,1072\" data-comments-opened=\"1\" data-image-meta=\"{&quot;aperture&quot;:&quot;0&quot;,&quot;credit&quot;:&quot;&quot;,&quot;camera&quot;:&quot;&quot;,&quot;caption&quot;:&quot;&quot;,&quot;created_timestamp&quot;:&quot;0&quot;,&quot;copyright&quot;:&quot;&quot;,&quot;focal_length&quot;:&quot;0&quot;,&quot;iso&quot;:&quot;0&quot;,&quot;shutter_speed&quot;:&quot;0&quot;,&quot;title&quot;:&quot;&quot;,&quot;orientation&quot;:&quot;0&quot;}\" data-image-title=\"OSRD Genealogy\" data-image-description=\"\" data-image-caption=\"\" data-medium-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?fit=300%2C222&amp;ssl=1\" data-large-file=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?fit=468%2C347&amp;ssl=1\" src=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?resize=468%2C347&amp;ssl=1\" alt=\"\" width=\"468\" height=\"347\" srcset=\"https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?resize=1024%2C759&amp;ssl=1 1024w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?resize=300%2C222&amp;ssl=1 300w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?resize=150%2C111&amp;ssl=1 150w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?resize=768%2C569&amp;ssl=1 768w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?w=1447&amp;ssl=1 1447w, https://i0.wp.com/steveblank.com/wp-content/uploads/2025/04/OSRD-Genealogy.jpg?w=936&amp;ssl=1 936w\" sizes=\"auto, (max-width: 468px) 100vw, 468px\"></a>Ironically, Vannevar Bush’s influence would decline even faster than Professor Lindemann’s. When President Roosevelt died in April 1945 and Secretary of War Stimson retired in September 1945, all the knives came out from the military leadership Bush had bypassed in the war. His arguments on how to reorganize OSR&amp;D made more enemies in Congress. By 1948 Bush had retired from government service. He would never again play a role in the U.S. government.</p><p>Britain’s focused, centralized model using government research labs was created in a struggle for short-term survival. They achieved brilliant breakthroughs but lacked the scale, integration and capital needed to dominate in the post-war world.</p><p>The U.S. built a decentralized, collaborative ecosystem, one that tightly integrated massive government funding of universities for research and prototypes while private industry built the solutions in volume.</p><p>A key component of this U.S. research ecosystem was the genius of the <a href=\"https://www.insidehighered.com/news/government/science-research-policy/2025/04/14/doe-puts-15-cap-universities-indirect-research\" target=\"_blank\" rel=\"noopener\">indirect cost reimbursement system</a>. Not only did the U.S. fund researchers in universities by paying the cost of their salaries, the U.S. gave universities money for the researchers facilities and administration. This was the secret sauce that allowed U.S. universities to build world-class labs for cutting-edge research that were the envy of the world. Scientists flocked to the U.S. causing other countries to complain of a “brain drain.”</p><p>Today, U.S. universities license 3,000 patents, 3,200 copyrights and 1,600 other licenses to technology startups and existing companies. Collectively, they spin out over 1,100 science-based startups each year, which lead to countless products and tens of thousands of new jobs. This university/government ecosystem became the blueprint for modern innovation ecosystems for other countries.</p><p>By the end of the war, the U.S. and British innovation systems had produced radically different outcomes. Both systems were influenced by the experience and personalities of their nations science advisor.</p><ul><li>Britain remained a leader in theoretical science and defense technology, but its socialist government economic policies led to its failure to commercialize wartime innovations.</li><li>The U.S. emerged as the global leader in science and technology, with innovations like electronics, microwaves, computing, and nuclear power driving its post-war economic boom.</li><li>The university-industry-government partnership became the foundation of Silicon Valley, the aerospace sector, and the biotechnology industry.</li><li>Today, China’s leadership has spent the last three decades investing heavily to surpass the U.S. in science and technology.</li><li>In 2025, with the abandonment of U.S. government support for university research, the long run of U.S. dominance in science may be over. Others will lead.</li></ul><p>\n\t\t\t\t\t\tFiled under: <a href=\"https://steveblank.com/category/science-and-industrial-policy/\" rel=\"category tag\">Science and Industrial Policy</a> |\t\t\t\t\t</p>","contentLength":12995,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43692360"},{"title":"4chan Sharty Hack And Janitor Email Leak","url":"https://knowyourmeme.com/memes/events/april-2025-4chan-sharty-hack-and-janitor-email-leak","date":1744716656,"author":"LookAtThatBacon","guid":214,"unread":true,"content":"<p><strong>April 2025 4chan Sharty Hack And Janitor Email Leak</strong> refers to the <a href=\"https://knowyourmeme.com/memes/sites/soyjakparty\">Soyjak.party</a> community's claimed hacking of 4chan in mid April 2025, which included the restoration of the deleted /QA/ board and leaking the emails of <a href=\"https://knowyourmeme.com/memes/sites/4chan\">4chan</a> \"janitors,\" who are members of the site's moderation team. The attackers reportedly exploited outdated PHP code and deprecated MySQL functions in 4chan's backend, particularly in a core script named yotsuba.php, which manages post submissions and moderation. A Soyjak.Party users also shared a list of emails they claimed are associated with janitor and moderator accounts, including three .edu emails. Although some <a href=\"https://knowyourmeme.com/memes/cultures/the-internet\">internet</a> users claimed that the leaks included .gov emails associated with members of the moderation team, this remains unverified.</p><p>4chan was reportedly hacked by internet users claiming to be part of the Soyjak.Party community on April 14th, 2025. The hackers brought back the deleted /QA/ board, and temporarily granted access to 4chan's administrative site. An anonymous user posted about the hack on Soyjak.Party around 10:05 PM EST. The thread contained several bits of leaked information, a look into the /j/ board as well as the entirety of the \"yotsuba.php\" code, which handles features like posting and reporting. Another post in the thread claimed to be leaking the email addresses associated with various janitors, three of which were .edu emails.</p><p>Early on April 15th, 2025, KiwiFarms user Coberald posted a copy of the leaked 4chan source code. A user named Tofflenheim also shared a link to an archive of posts on /j/, a private board dedicated to janitor discussions.</p><p>X user @Priniz_twt was one of the first to post about the hack on April 14th, 2025, gathering over 5,000 likes in less than a day.</p><p>On April 14th and April 15th, 2025, X user @_yushe posted screenshots from the 4chan administrative page as well as analyzed the leaked \"yotsuba.php\" code, which handles features like posting and reporting. The post gathered over 500 likes in less than a day.</p><p>On April 15th, X user @_yushe noted that 4chan was likely hacked because it was using an outdated version of PHP (a coding language used to run the site), which is full of known vulnerabilities, and deprecated (no longer supported) functions to handle its database.</p><p>Also on April 14th, X user @LumpyTheCook tweeted, \"Apparently 4chan is down because someone hacked the lead admin (Hiro) account and started leaking all the mod and janitor emails, contact info, chat logs, etc. Good job Hiro 👍\" The thread also included the unconfirmed claim that some janitors were using .gov emails, (although some leaked lists did contained .edu emails).</p><p>On April 15th, 2025, <a href=\"https://knowyourmeme.com/memes/sites/reddit\">Redditor</a> /u/Meteorstar101 posted to the /r/greentext subreddit, writing, \"Last posts before 4chan got hacked,\" and showing the <a href=\"https://knowyourmeme.com/memes/chicken-jockey-minecraft-movie\">Chicken Jockey</a> meme.</p>","contentLength":2818,"flags":null,"enclosureUrl":"","enclosureMime":"","commentsUrl":"https://news.ycombinator.com/item?id=43691334"}],"tags":["dev","hn"]}